garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile MAINPRbits_t MAINPRbits __at(0x039);
// bitfield macros
#define _MAINPR_PR_POSN                                     0x0
#define _MAINPR_PR_POSITION                                 0x0
#define _MAINPR_PR_SIZE                                     0x3
#define _MAINPR_PR_LENGTH                                   0x3
#define _MAINPR_PR_MASK                                     0x7
#define _MAINPR_PR0_POSN                                    0x0
#define _MAINPR_PR0_POSITION                                0x0
#define _MAINPR_PR0_SIZE                                    0x1
#define _MAINPR_PR0_LENGTH                                  0x1
#define _MAINPR_PR0_MASK                                    0x1
#define _MAINPR_PR1_POSN                                    0x1
#define _MAINPR_PR1_POSITION                                0x1
#define _MAINPR_PR1_SIZE                                    0x1
#define _MAINPR_PR1_LENGTH                                  0x1
#define _MAINPR_PR1_MASK                                    0x2
#define _MAINPR_PR2_POSN                                    0x2
#define _MAINPR_PR2_POSITION                                0x2
#define _MAINPR_PR2_SIZE                                    0x1
#define _MAINPR_PR2_LENGTH                                  0x1
#define _MAINPR_PR2_MASK                                    0x4
#define _MAINPR_MAINPR_POSN                                 0x0
#define _MAINPR_MAINPR_POSITION                             0x0
#define _MAINPR_MAINPR_SIZE                                 0x3
#define _MAINPR_MAINPR_LENGTH                               0x3
#define _MAINPR_MAINPR_MASK                                 0x7
#define _MAINPR_MAINPR0_POSN                                0x0
#define _MAINPR_MAINPR0_POSITION                            0x0
#define _MAINPR_MAINPR0_SIZE                                0x1
#define _MAINPR_MAINPR0_LENGTH                              0x1
#define _MAINPR_MAINPR0_MASK                                0x1
#define _MAINPR_MAINPR1_POSN                                0x1
#define _MAINPR_MAINPR1_POSITION                            0x1
#define _MAINPR_MAINPR1_SIZE                                0x1
#define _MAINPR_MAINPR1_LENGTH                              0x1
#define _MAINPR_MAINPR1_MASK                                0x2
#define _MAINPR_MAINPR2_POSN                                0x2
#define _MAINPR_MAINPR2_POSITION                            0x2
#define _MAINPR_MAINPR2_SIZE                                0x1
#define _MAINPR_MAINPR2_LENGTH                              0x1
#define _MAINPR_MAINPR2_MASK                                0x4

// Register: ISRPR
#define ISRPR ISRPR
extern volatile unsigned char           ISRPR               __at(0x03A);
#ifndef _LIB_BUILD
asm("ISRPR equ 03Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned ISRPR                  :3;
    };
    struct {
        unsigned ISRPR0                 :1;
        unsigned ISRPR1                 :1;
        unsigned ISRPR2                 :1;
    };
} ISRPRbits_t;
extern volatile ISRPRbits_t ISRPRbits __at(0x03A);
// bitfield macros
#define _ISRPR_PR_POSN                                      0x0
#define _ISRPR_PR_POSITION                                  0x0
#define _ISRPR_PR_SIZE                                      0x3
#define _ISRPR_PR_LENGTH                                    0x3
#define _ISRPR_PR_MASK                                      0x7
#define _ISRPR_PR0_POSN                                     0x0
#define _ISRPR_PR0_POSITION                                 0x0
#define _ISRPR_PR0_SIZE                                     0x1
#define _ISRPR_PR0_LENGTH                                   0x1
#define _ISRPR_PR0_MASK                                     0x1
#define _ISRPR_PR1_POSN                                     0x1
#define _ISRPR_PR1_POSITION                                 0x1
#define _ISRPR_PR1_SIZE                                     0x1
#define _ISRPR_PR1_LENGTH                                   0x1
#define _ISRPR_PR1_MASK                                     0x2
#define _ISRPR_PR2_POSN                                     0x2
#define _ISRPR_PR2_POSITION                                 0x2
#define _ISRPR_PR2_SIZE                                     0x1
#define _ISRPR_PR2_LENGTH                                   0x1
#define _ISRPR_PR2_MASK                                     0x4
#define _ISRPR_ISRPR_POSN                                   0x0
#define _ISRPR_ISRPR_POSITION                               0x0
#define _ISRPR_ISRPR_SIZE                                   0x3
#define _ISRPR_ISRPR_LENGTH                                 0x3
#define _ISRPR_ISRPR_MASK                                   0x7
#define _ISRPR_ISRPR0_POSN                                  0x0
#define _ISRPR_ISRPR0_POSITION                              0x0
#define _ISRPR_ISRPR0_SIZE                                  0x1
#define _ISRPR_ISRPR0_LENGTH                                0x1
#define _ISRPR_ISRPR0_MASK                                  0x1
#define _ISRPR_ISRPR1_POSN                                  0x1
#define _ISRPR_ISRPR1_POSITION                              0x1
#define _ISRPR_ISRPR1_SIZE                                  0x1
#define _ISRPR_ISRPR1_LENGTH                                0x1
#define _ISRPR_ISRPR1_MASK                                  0x2
#define _ISRPR_ISRPR2_POSN                                  0x2
#define _ISRPR_ISRPR2_POSITION                              0x2
#define _ISRPR_ISRPR2_SIZE                                  0x1
#define _ISRPR_ISRPR2_LENGTH                                0x1
#define _ISRPR_ISRPR2_MASK                                  0x4

// Register: DMA1PR
#define DMA1PR DMA1PR
extern volatile unsigned char           DMA1PR              __at(0x03B);
#ifndef _LIB_BUILD
asm("DMA1PR equ 03Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA1PR                 :3;
    };
    struct {
        unsigned DMA1PR0                :1;
        unsigned DMA1PR1                :1;
        unsigned DMA1PR2                :1;
    };
} DMA1PRbits_t;
