garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile DMA1PRbits_t DMA1PRbits __at(0x03B);
// bitfield macros
#define _DMA1PR_PR_POSN                                     0x0
#define _DMA1PR_PR_POSITION                                 0x0
#define _DMA1PR_PR_SIZE                                     0x3
#define _DMA1PR_PR_LENGTH                                   0x3
#define _DMA1PR_PR_MASK                                     0x7
#define _DMA1PR_PR0_POSN                                    0x0
#define _DMA1PR_PR0_POSITION                                0x0
#define _DMA1PR_PR0_SIZE                                    0x1
#define _DMA1PR_PR0_LENGTH                                  0x1
#define _DMA1PR_PR0_MASK                                    0x1
#define _DMA1PR_PR1_POSN                                    0x1
#define _DMA1PR_PR1_POSITION                                0x1
#define _DMA1PR_PR1_SIZE                                    0x1
#define _DMA1PR_PR1_LENGTH                                  0x1
#define _DMA1PR_PR1_MASK                                    0x2
#define _DMA1PR_PR2_POSN                                    0x2
#define _DMA1PR_PR2_POSITION                                0x2
#define _DMA1PR_PR2_SIZE                                    0x1
#define _DMA1PR_PR2_LENGTH                                  0x1
#define _DMA1PR_PR2_MASK                                    0x4
#define _DMA1PR_DMA1PR_POSN                                 0x0
#define _DMA1PR_DMA1PR_POSITION                             0x0
#define _DMA1PR_DMA1PR_SIZE                                 0x3
#define _DMA1PR_DMA1PR_LENGTH                               0x3
#define _DMA1PR_DMA1PR_MASK                                 0x7
#define _DMA1PR_DMA1PR0_POSN                                0x0
#define _DMA1PR_DMA1PR0_POSITION                            0x0
#define _DMA1PR_DMA1PR0_SIZE                                0x1
#define _DMA1PR_DMA1PR0_LENGTH                              0x1
#define _DMA1PR_DMA1PR0_MASK                                0x1
#define _DMA1PR_DMA1PR1_POSN                                0x1
#define _DMA1PR_DMA1PR1_POSITION                            0x1
#define _DMA1PR_DMA1PR1_SIZE                                0x1
#define _DMA1PR_DMA1PR1_LENGTH                              0x1
#define _DMA1PR_DMA1PR1_MASK                                0x2
#define _DMA1PR_DMA1PR2_POSN                                0x2
#define _DMA1PR_DMA1PR2_POSITION                            0x2
#define _DMA1PR_DMA1PR2_SIZE                                0x1
#define _DMA1PR_DMA1PR2_LENGTH                              0x1
#define _DMA1PR_DMA1PR2_MASK                                0x4

// Register: DMA2PR
#define DMA2PR DMA2PR
extern volatile unsigned char           DMA2PR              __at(0x03C);
#ifndef _LIB_BUILD
asm("DMA2PR equ 03Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA2PR                 :3;
    };
    struct {
        unsigned DMA2PR0                :1;
        unsigned DMA2PR1                :1;
        unsigned DMA2PR2                :1;
    };
} DMA2PRbits_t;
extern volatile DMA2PRbits_t DMA2PRbits __at(0x03C);
// bitfield macros
#define _DMA2PR_PR_POSN                                     0x0
#define _DMA2PR_PR_POSITION                                 0x0
#define _DMA2PR_PR_SIZE                                     0x3
#define _DMA2PR_PR_LENGTH                                   0x3
#define _DMA2PR_PR_MASK                                     0x7
#define _DMA2PR_PR0_POSN                                    0x0
#define _DMA2PR_PR0_POSITION                                0x0
#define _DMA2PR_PR0_SIZE                                    0x1
#define _DMA2PR_PR0_LENGTH                                  0x1
#define _DMA2PR_PR0_MASK                                    0x1
#define _DMA2PR_PR1_POSN                                    0x1
#define _DMA2PR_PR1_POSITION                                0x1
#define _DMA2PR_PR1_SIZE                                    0x1
#define _DMA2PR_PR1_LENGTH                                  0x1
#define _DMA2PR_PR1_MASK                                    0x2
#define _DMA2PR_PR2_POSN                                    0x2
#define _DMA2PR_PR2_POSITION                                0x2
#define _DMA2PR_PR2_SIZE                                    0x1
#define _DMA2PR_PR2_LENGTH                                  0x1
#define _DMA2PR_PR2_MASK                                    0x4
#define _DMA2PR_DMA2PR_POSN                                 0x0
#define _DMA2PR_DMA2PR_POSITION                             0x0
#define _DMA2PR_DMA2PR_SIZE                                 0x3
#define _DMA2PR_DMA2PR_LENGTH                               0x3
#define _DMA2PR_DMA2PR_MASK                                 0x7
#define _DMA2PR_DMA2PR0_POSN                                0x0
#define _DMA2PR_DMA2PR0_POSITION                            0x0
#define _DMA2PR_DMA2PR0_SIZE                                0x1
#define _DMA2PR_DMA2PR0_LENGTH                              0x1
#define _DMA2PR_DMA2PR0_MASK                                0x1
#define _DMA2PR_DMA2PR1_POSN                                0x1
#define _DMA2PR_DMA2PR1_POSITION                            0x1
#define _DMA2PR_DMA2PR1_SIZE                                0x1
#define _DMA2PR_DMA2PR1_LENGTH                              0x1
#define _DMA2PR_DMA2PR1_MASK                                0x2
#define _DMA2PR_DMA2PR2_POSN                                0x2
#define _DMA2PR_DMA2PR2_POSITION                            0x2
#define _DMA2PR_DMA2PR2_SIZE                                0x1
#define _DMA2PR_DMA2PR2_LENGTH                              0x1
#define _DMA2PR_DMA2PR2_MASK                                0x4

// Register: DMA3PR
#define DMA3PR DMA3PR
extern volatile unsigned char           DMA3PR              __at(0x03D);
#ifndef _LIB_BUILD
asm("DMA3PR equ 03Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA3PR                 :3;
    };
    struct {
        unsigned DMA3PR0                :1;
        unsigned DMA3PR1                :1;
        unsigned DMA3PR2                :1;
    };
} DMA3PRbits_t;
