garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile DMA3PRbits_t DMA3PRbits __at(0x03D);
// bitfield macros
#define _DMA3PR_PR_POSN                                     0x0
#define _DMA3PR_PR_POSITION                                 0x0
#define _DMA3PR_PR_SIZE                                     0x3
#define _DMA3PR_PR_LENGTH                                   0x3
#define _DMA3PR_PR_MASK                                     0x7
#define _DMA3PR_PR0_POSN                                    0x0
#define _DMA3PR_PR0_POSITION                                0x0
#define _DMA3PR_PR0_SIZE                                    0x1
#define _DMA3PR_PR0_LENGTH                                  0x1
#define _DMA3PR_PR0_MASK                                    0x1
#define _DMA3PR_PR1_POSN                                    0x1
#define _DMA3PR_PR1_POSITION                                0x1
#define _DMA3PR_PR1_SIZE                                    0x1
#define _DMA3PR_PR1_LENGTH                                  0x1
#define _DMA3PR_PR1_MASK                                    0x2
#define _DMA3PR_PR2_POSN                                    0x2
#define _DMA3PR_PR2_POSITION                                0x2
#define _DMA3PR_PR2_SIZE                                    0x1
#define _DMA3PR_PR2_LENGTH                                  0x1
#define _DMA3PR_PR2_MASK                                    0x4
#define _DMA3PR_DMA3PR_POSN                                 0x0
#define _DMA3PR_DMA3PR_POSITION                             0x0
#define _DMA3PR_DMA3PR_SIZE                                 0x3
#define _DMA3PR_DMA3PR_LENGTH                               0x3
#define _DMA3PR_DMA3PR_MASK                                 0x7
#define _DMA3PR_DMA3PR0_POSN                                0x0
#define _DMA3PR_DMA3PR0_POSITION                            0x0
#define _DMA3PR_DMA3PR0_SIZE                                0x1
#define _DMA3PR_DMA3PR0_LENGTH                              0x1
#define _DMA3PR_DMA3PR0_MASK                                0x1
#define _DMA3PR_DMA3PR1_POSN                                0x1
#define _DMA3PR_DMA3PR1_POSITION                            0x1
#define _DMA3PR_DMA3PR1_SIZE                                0x1
#define _DMA3PR_DMA3PR1_LENGTH                              0x1
#define _DMA3PR_DMA3PR1_MASK                                0x2
#define _DMA3PR_DMA3PR2_POSN                                0x2
#define _DMA3PR_DMA3PR2_POSITION                            0x2
#define _DMA3PR_DMA3PR2_SIZE                                0x1
#define _DMA3PR_DMA3PR2_LENGTH                              0x1
#define _DMA3PR_DMA3PR2_MASK                                0x4

// Register: DMA4PR
#define DMA4PR DMA4PR
extern volatile unsigned char           DMA4PR              __at(0x03E);
#ifndef _LIB_BUILD
asm("DMA4PR equ 03Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA4PR                 :3;
    };
    struct {
        unsigned DMA4PR0                :1;
        unsigned DMA4PR1                :1;
        unsigned DMA4PR2                :1;
    };
} DMA4PRbits_t;
extern volatile DMA4PRbits_t DMA4PRbits __at(0x03E);
// bitfield macros
#define _DMA4PR_PR_POSN                                     0x0
#define _DMA4PR_PR_POSITION                                 0x0
#define _DMA4PR_PR_SIZE                                     0x3
#define _DMA4PR_PR_LENGTH                                   0x3
#define _DMA4PR_PR_MASK                                     0x7
#define _DMA4PR_PR0_POSN                                    0x0
#define _DMA4PR_PR0_POSITION                                0x0
#define _DMA4PR_PR0_SIZE                                    0x1
#define _DMA4PR_PR0_LENGTH                                  0x1
#define _DMA4PR_PR0_MASK                                    0x1
#define _DMA4PR_PR1_POSN                                    0x1
#define _DMA4PR_PR1_POSITION                                0x1
#define _DMA4PR_PR1_SIZE                                    0x1
#define _DMA4PR_PR1_LENGTH                                  0x1
#define _DMA4PR_PR1_MASK                                    0x2
#define _DMA4PR_PR2_POSN                                    0x2
#define _DMA4PR_PR2_POSITION                                0x2
#define _DMA4PR_PR2_SIZE                                    0x1
#define _DMA4PR_PR2_LENGTH                                  0x1
#define _DMA4PR_PR2_MASK                                    0x4
#define _DMA4PR_DMA4PR_POSN                                 0x0
#define _DMA4PR_DMA4PR_POSITION                             0x0
#define _DMA4PR_DMA4PR_SIZE                                 0x3
#define _DMA4PR_DMA4PR_LENGTH                               0x3
#define _DMA4PR_DMA4PR_MASK                                 0x7
#define _DMA4PR_DMA4PR0_POSN                                0x0
#define _DMA4PR_DMA4PR0_POSITION                            0x0
#define _DMA4PR_DMA4PR0_SIZE                                0x1
#define _DMA4PR_DMA4PR0_LENGTH                              0x1
#define _DMA4PR_DMA4PR0_MASK                                0x1
#define _DMA4PR_DMA4PR1_POSN                                0x1
#define _DMA4PR_DMA4PR1_POSITION                            0x1
#define _DMA4PR_DMA4PR1_SIZE                                0x1
#define _DMA4PR_DMA4PR1_LENGTH                              0x1
#define _DMA4PR_DMA4PR1_MASK                                0x2
#define _DMA4PR_DMA4PR2_POSN                                0x2
#define _DMA4PR_DMA4PR2_POSITION                            0x2
#define _DMA4PR_DMA4PR2_SIZE                                0x1
#define _DMA4PR_DMA4PR2_LENGTH                              0x1
#define _DMA4PR_DMA4PR2_MASK                                0x4

// Register: SCANPR
#define SCANPR SCANPR
extern volatile unsigned char           SCANPR              __at(0x03F);
#ifndef _LIB_BUILD
asm("SCANPR equ 03Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned SCANPR                 :3;
    };
    struct {
        unsigned SCANPR0                :1;
        unsigned SCANPR1                :1;
        unsigned SCANPR2                :1;
    };
} SCANPRbits_t;
extern volatile SCANPRbits_t SCANPRbits __at(0x03F);
// bitfield macros
#define _SCANPR_PR_POSN                                     0x0
#define _SCANPR_PR_POSITION                                 0x0
#define _SCANPR_PR_SIZE                                     0x3
#define _SCANPR_PR_LENGTH                                   0x3
#define _SCANPR_PR_MASK                                     0x7
#define _SCANPR_PR0_POSN                                    0x0
#define _SCANPR_PR0_POSITION                                0x0
#define _SCANPR_PR0_SIZE                                    0x1
#define _SCANPR_PR0_LENGTH                                  0x1
#define _SCANPR_PR0_MASK                                    0x1
#define _SCANPR_PR1_POSN                                    0x1
#define _SCANPR_PR1_POSITION                                0x1
#define _SCANPR_PR1_SIZE                                    0x1
#define _SCANPR_PR1_LENGTH                                  0x1
#define _SCANPR_PR1_MASK                                    0x2
#define _SCANPR_PR2_POSN                                    0x2
#define _SCANPR_PR2_POSITION                                0x2
#define _SCANPR_PR2_SIZE                                    0x1
#define _SCANPR_PR2_LENGTH                                  0x1
#define _SCANPR_PR2_MASK                                    0x4
#define _SCANPR_SCANPR_POSN                                 0x0
#define _SCANPR_SCANPR_POSITION                             0x0
#define _SCANPR_SCANPR_SIZE                                 0x3
#define _SCANPR_SCANPR_LENGTH                               0x3
#define _SCANPR_SCANPR_MASK                                 0x7
#define _SCANPR_SCANPR0_POSN                                0x0
#define _SCANPR_SCANPR0_POSITION                            0x0
#define _SCANPR_SCANPR0_SIZE                                0x1
#define _SCANPR_SCANPR0_LENGTH                              0x1
#define _SCANPR_SCANPR0_MASK                                0x1
#define _SCANPR_SCANPR1_POSN                                0x1
#define _SCANPR_SCANPR1_POSITION                            0x1
#define _SCANPR_SCANPR1_SIZE                                0x1
#define _SCANPR_SCANPR1_LENGTH                              0x1
#define _SCANPR_SCANPR1_MASK                                0x2
#define _SCANPR_SCANPR2_POSN                                0x2
#define _SCANPR_SCANPR2_POSITION                            0x2
#define _SCANPR_SCANPR2_SIZE                                0x1
#define _SCANPR_SCANPR2_LENGTH                              0x1
#define _SCANPR_SCANPR2_MASK                                0x4

