garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile TU16ACRLbits_t TU16ACRLbits __at(0x130);
// bitfield macros
#define _TU16ACRL_CRL_POSN                                  0x0
#define _TU16ACRL_CRL_POSITION                              0x0
#define _TU16ACRL_CRL_SIZE                                  0x8
#define _TU16ACRL_CRL_LENGTH                                0x8
#define _TU16ACRL_CRL_MASK                                  0xFF
#define _TU16ACRL_CRL0_POSN                                 0x0
#define _TU16ACRL_CRL0_POSITION                             0x0
#define _TU16ACRL_CRL0_SIZE                                 0x1
#define _TU16ACRL_CRL0_LENGTH                               0x1
#define _TU16ACRL_CRL0_MASK                                 0x1
#define _TU16ACRL_CRL1_POSN                                 0x1
#define _TU16ACRL_CRL1_POSITION                             0x1
#define _TU16ACRL_CRL1_SIZE                                 0x1
#define _TU16ACRL_CRL1_LENGTH                               0x1
#define _TU16ACRL_CRL1_MASK                                 0x2
#define _TU16ACRL_CRL2_POSN                                 0x2
#define _TU16ACRL_CRL2_POSITION                             0x2
#define _TU16ACRL_CRL2_SIZE                                 0x1
#define _TU16ACRL_CRL2_LENGTH                               0x1
#define _TU16ACRL_CRL2_MASK                                 0x4
#define _TU16ACRL_CRL3_POSN                                 0x3
#define _TU16ACRL_CRL3_POSITION                             0x3
#define _TU16ACRL_CRL3_SIZE                                 0x1
#define _TU16ACRL_CRL3_LENGTH                               0x1
#define _TU16ACRL_CRL3_MASK                                 0x8
#define _TU16ACRL_CRL4_POSN                                 0x4
#define _TU16ACRL_CRL4_POSITION                             0x4
#define _TU16ACRL_CRL4_SIZE                                 0x1
#define _TU16ACRL_CRL4_LENGTH                               0x1
#define _TU16ACRL_CRL4_MASK                                 0x10
#define _TU16ACRL_CRL5_POSN                                 0x5
#define _TU16ACRL_CRL5_POSITION                             0x5
#define _TU16ACRL_CRL5_SIZE                                 0x1
#define _TU16ACRL_CRL5_LENGTH                               0x1
#define _TU16ACRL_CRL5_MASK                                 0x20
#define _TU16ACRL_CRL6_POSN                                 0x6
#define _TU16ACRL_CRL6_POSITION                             0x6
#define _TU16ACRL_CRL6_SIZE                                 0x1
#define _TU16ACRL_CRL6_LENGTH                               0x1
#define _TU16ACRL_CRL6_MASK                                 0x40
#define _TU16ACRL_CRL7_POSN                                 0x7
#define _TU16ACRL_CRL7_POSITION                             0x7
#define _TU16ACRL_CRL7_SIZE                                 0x1
#define _TU16ACRL_CRL7_LENGTH                               0x1
#define _TU16ACRL_CRL7_MASK                                 0x80
#define _TU16ACRL_TU16ACRL0_POSN                            0x0
#define _TU16ACRL_TU16ACRL0_POSITION                        0x0
#define _TU16ACRL_TU16ACRL0_SIZE                            0x1
#define _TU16ACRL_TU16ACRL0_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL0_MASK                            0x1
#define _TU16ACRL_TU16ACRL1_POSN                            0x1
#define _TU16ACRL_TU16ACRL1_POSITION                        0x1
#define _TU16ACRL_TU16ACRL1_SIZE                            0x1
#define _TU16ACRL_TU16ACRL1_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL1_MASK                            0x2
#define _TU16ACRL_TU16ACRL2_POSN                            0x2
#define _TU16ACRL_TU16ACRL2_POSITION                        0x2
#define _TU16ACRL_TU16ACRL2_SIZE                            0x1
#define _TU16ACRL_TU16ACRL2_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL2_MASK                            0x4
#define _TU16ACRL_TU16ACRL3_POSN                            0x3
#define _TU16ACRL_TU16ACRL3_POSITION                        0x3
#define _TU16ACRL_TU16ACRL3_SIZE                            0x1
#define _TU16ACRL_TU16ACRL3_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL3_MASK                            0x8
#define _TU16ACRL_TU16ACRL4_POSN                            0x4
#define _TU16ACRL_TU16ACRL4_POSITION                        0x4
#define _TU16ACRL_TU16ACRL4_SIZE                            0x1
#define _TU16ACRL_TU16ACRL4_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL4_MASK                            0x10
#define _TU16ACRL_TU16ACRL5_POSN                            0x5
#define _TU16ACRL_TU16ACRL5_POSITION                        0x5
#define _TU16ACRL_TU16ACRL5_SIZE                            0x1
#define _TU16ACRL_TU16ACRL5_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL5_MASK                            0x20
#define _TU16ACRL_TU16ACRL6_POSN                            0x6
#define _TU16ACRL_TU16ACRL6_POSITION                        0x6
#define _TU16ACRL_TU16ACRL6_SIZE                            0x1
#define _TU16ACRL_TU16ACRL6_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL6_MASK                            0x40
#define _TU16ACRL_TU16ACRL7_POSN                            0x7
#define _TU16ACRL_TU16ACRL7_POSITION                        0x7
#define _TU16ACRL_TU16ACRL7_SIZE                            0x1
#define _TU16ACRL_TU16ACRL7_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL7_MASK                            0x80
#define _TU16ACRL_TU16ACR0_POSN                             0x0
#define _TU16ACRL_TU16ACR0_POSITION                         0x0
#define _TU16ACRL_TU16ACR0_SIZE                             0x1
#define _TU16ACRL_TU16ACR0_LENGTH                           0x1
#define _TU16ACRL_TU16ACR0_MASK                             0x1
#define _TU16ACRL_TU16ACR1_POSN                             0x1
#define _TU16ACRL_TU16ACR1_POSITION                         0x1
#define _TU16ACRL_TU16ACR1_SIZE                             0x1
#define _TU16ACRL_TU16ACR1_LENGTH                           0x1
#define _TU16ACRL_TU16ACR1_MASK                             0x2
#define _TU16ACRL_TU16ACR2_POSN                             0x2
#define _TU16ACRL_TU16ACR2_POSITION                         0x2
#define _TU16ACRL_TU16ACR2_SIZE                             0x1
#define _TU16ACRL_TU16ACR2_LENGTH                           0x1
#define _TU16ACRL_TU16ACR2_MASK                             0x4
#define _TU16ACRL_TU16ACR3_POSN                             0x3
#define _TU16ACRL_TU16ACR3_POSITION                         0x3
#define _TU16ACRL_TU16ACR3_SIZE                             0x1
#define _TU16ACRL_TU16ACR3_LENGTH                           0x1
#define _TU16ACRL_TU16ACR3_MASK                             0x8
#define _TU16ACRL_TU16ACR4_POSN                             0x4
#define _TU16ACRL_TU16ACR4_POSITION                         0x4
#define _TU16ACRL_TU16ACR4_SIZE                             0x1
#define _TU16ACRL_TU16ACR4_LENGTH                           0x1
#define _TU16ACRL_TU16ACR4_MASK                             0x10
#define _TU16ACRL_TU16ACR5_POSN                             0x5
#define _TU16ACRL_TU16ACR5_POSITION                         0x5
#define _TU16ACRL_TU16ACR5_SIZE                             0x1
#define _TU16ACRL_TU16ACR5_LENGTH                           0x1
#define _TU16ACRL_TU16ACR5_MASK                             0x20
#define _TU16ACRL_TU16ACR6_POSN                             0x6
#define _TU16ACRL_TU16ACR6_POSITION                         0x6
#define _TU16ACRL_TU16ACR6_SIZE                             0x1
#define _TU16ACRL_TU16ACR6_LENGTH                           0x1
#define _TU16ACRL_TU16ACR6_MASK                             0x40
#define _TU16ACRL_TU16ACR7_POSN                             0x7
#define _TU16ACRL_TU16ACR7_POSITION                         0x7
#define _TU16ACRL_TU16ACR7_SIZE                             0x1
#define _TU16ACRL_TU16ACR7_LENGTH                           0x1
#define _TU16ACRL_TU16ACR7_MASK                             0x80

// Register: TU16ATMRH
#define TU16ATMRH TU16ATMRH
extern volatile unsigned char           TU16ATMRH           __at(0x131);
#ifndef _LIB_BUILD
asm("TU16ATMRH equ 0131h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRH                   :8;
    };
    struct {
        unsigned TMRH0                  :1;
        unsigned TMRH1                  :1;
        unsigned TMRH2                  :1;
        unsigned TMRH3                  :1;
        unsigned TMRH4                  :1;
        unsigned TMRH5                  :1;
        unsigned TMRH6                  :1;
        unsigned TMRH7                  :1;
    };
    struct {
        unsigned TU16ATMRH0             :1;
        unsigned TU16ATMRH1             :1;
        unsigned TU16ATMRH2             :1;
        unsigned TU16ATMRH3             :1;
        unsigned TU16ATMRH4             :1;
        unsigned TU16ATMRH5             :1;
        unsigned TU16ATMRH6             :1;
        unsigned TU16ATMRH7             :1;
    };
    struct {
        unsigned TU16ATMR8              :1;
        unsigned TU16ATMR9              :1;
        unsigned TU16ATMR10             :1;
        unsigned TU16ATMR11             :1;
        unsigned TU16ATMR12             :1;
        unsigned TU16ATMR13             :1;
        unsigned TU16ATMR14             :1;
        unsigned TU16ATMR15             :1;
    };
} TU16ATMRHbits_t;
