garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
// Register: TU16BCRL
#define TU16BCRL TU16BCRL
extern volatile unsigned char           TU16BCRL            __at(0x13E);
#ifndef _LIB_BUILD
asm("TU16BCRL equ 013Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRL                    :8;
    };
    struct {
        unsigned CRL0                   :1;
        unsigned CRL1                   :1;
        unsigned CRL2                   :1;
        unsigned CRL3                   :1;
        unsigned CRL4                   :1;
        unsigned CRL5                   :1;
        unsigned CRL6                   :1;
        unsigned CRL7                   :1;
    };
    struct {
        unsigned TU16BCRL0              :1;
        unsigned TU16BCRL1              :1;
        unsigned TU16BCRL2              :1;
        unsigned TU16BCRL3              :1;
        unsigned TU16BCRL4              :1;
        unsigned TU16BCRL5              :1;
        unsigned TU16BCRL6              :1;
        unsigned TU16BCRL7              :1;
    };
    struct {
        unsigned TU16BCR0               :1;
        unsigned TU16BCR1               :1;
        unsigned TU16BCR2               :1;
        unsigned TU16BCR3               :1;
        unsigned TU16BCR4               :1;
        unsigned TU16BCR5               :1;
        unsigned TU16BCR6               :1;
        unsigned TU16BCR7               :1;
    };
} TU16BCRLbits_t;
extern volatile TU16BCRLbits_t TU16BCRLbits __at(0x13E);
// bitfield macros
#define _TU16BCRL_CRL_POSN                                  0x0
#define _TU16BCRL_CRL_POSITION                              0x0
#define _TU16BCRL_CRL_SIZE                                  0x8
#define _TU16BCRL_CRL_LENGTH                                0x8
#define _TU16BCRL_CRL_MASK                                  0xFF
#define _TU16BCRL_CRL0_POSN                                 0x0
#define _TU16BCRL_CRL0_POSITION                             0x0
#define _TU16BCRL_CRL0_SIZE                                 0x1
#define _TU16BCRL_CRL0_LENGTH                               0x1
#define _TU16BCRL_CRL0_MASK                                 0x1
#define _TU16BCRL_CRL1_POSN                                 0x1
#define _TU16BCRL_CRL1_POSITION                             0x1
#define _TU16BCRL_CRL1_SIZE                                 0x1
#define _TU16BCRL_CRL1_LENGTH                               0x1
#define _TU16BCRL_CRL1_MASK                                 0x2
#define _TU16BCRL_CRL2_POSN                                 0x2
#define _TU16BCRL_CRL2_POSITION                             0x2
#define _TU16BCRL_CRL2_SIZE                                 0x1
#define _TU16BCRL_CRL2_LENGTH                               0x1
#define _TU16BCRL_CRL2_MASK                                 0x4
#define _TU16BCRL_CRL3_POSN                                 0x3
#define _TU16BCRL_CRL3_POSITION                             0x3
#define _TU16BCRL_CRL3_SIZE                                 0x1
#define _TU16BCRL_CRL3_LENGTH                               0x1
#define _TU16BCRL_CRL3_MASK                                 0x8
#define _TU16BCRL_CRL4_POSN                                 0x4
#define _TU16BCRL_CRL4_POSITION                             0x4
#define _TU16BCRL_CRL4_SIZE                                 0x1
#define _TU16BCRL_CRL4_LENGTH                               0x1
#define _TU16BCRL_CRL4_MASK                                 0x10
#define _TU16BCRL_CRL5_POSN                                 0x5
#define _TU16BCRL_CRL5_POSITION                             0x5
#define _TU16BCRL_CRL5_SIZE                                 0x1
#define _TU16BCRL_CRL5_LENGTH                               0x1
#define _TU16BCRL_CRL5_MASK                                 0x20
#define _TU16BCRL_CRL6_POSN                                 0x6
#define _TU16BCRL_CRL6_POSITION                             0x6
#define _TU16BCRL_CRL6_SIZE                                 0x1
#define _TU16BCRL_CRL6_LENGTH                               0x1
#define _TU16BCRL_CRL6_MASK                                 0x40
#define _TU16BCRL_CRL7_POSN                                 0x7
#define _TU16BCRL_CRL7_POSITION                             0x7
#define _TU16BCRL_CRL7_SIZE                                 0x1
#define _TU16BCRL_CRL7_LENGTH                               0x1
#define _TU16BCRL_CRL7_MASK                                 0x80
#define _TU16BCRL_TU16BCRL0_POSN                            0x0
#define _TU16BCRL_TU16BCRL0_POSITION                        0x0
#define _TU16BCRL_TU16BCRL0_SIZE                            0x1
#define _TU16BCRL_TU16BCRL0_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL0_MASK                            0x1
#define _TU16BCRL_TU16BCRL1_POSN                            0x1
#define _TU16BCRL_TU16BCRL1_POSITION                        0x1
#define _TU16BCRL_TU16BCRL1_SIZE                            0x1
#define _TU16BCRL_TU16BCRL1_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL1_MASK                            0x2
#define _TU16BCRL_TU16BCRL2_POSN                            0x2
#define _TU16BCRL_TU16BCRL2_POSITION                        0x2
#define _TU16BCRL_TU16BCRL2_SIZE                            0x1
#define _TU16BCRL_TU16BCRL2_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL2_MASK                            0x4
#define _TU16BCRL_TU16BCRL3_POSN                            0x3
#define _TU16BCRL_TU16BCRL3_POSITION                        0x3
#define _TU16BCRL_TU16BCRL3_SIZE                            0x1
#define _TU16BCRL_TU16BCRL3_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL3_MASK                            0x8
#define _TU16BCRL_TU16BCRL4_POSN                            0x4
#define _TU16BCRL_TU16BCRL4_POSITION                        0x4
#define _TU16BCRL_TU16BCRL4_SIZE                            0x1
#define _TU16BCRL_TU16BCRL4_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL4_MASK                            0x10
#define _TU16BCRL_TU16BCRL5_POSN                            0x5
#define _TU16BCRL_TU16BCRL5_POSITION                        0x5
#define _TU16BCRL_TU16BCRL5_SIZE                            0x1
#define _TU16BCRL_TU16BCRL5_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL5_MASK                            0x20
#define _TU16BCRL_TU16BCRL6_POSN                            0x6
#define _TU16BCRL_TU16BCRL6_POSITION                        0x6
#define _TU16BCRL_TU16BCRL6_SIZE                            0x1
#define _TU16BCRL_TU16BCRL6_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL6_MASK                            0x40
#define _TU16BCRL_TU16BCRL7_POSN                            0x7
#define _TU16BCRL_TU16BCRL7_POSITION                        0x7
#define _TU16BCRL_TU16BCRL7_SIZE                            0x1
#define _TU16BCRL_TU16BCRL7_LENGTH                          0x1
#define _TU16BCRL_TU16BCRL7_MASK                            0x80
#define _TU16BCRL_TU16BCR0_POSN                             0x0
#define _TU16BCRL_TU16BCR0_POSITION                         0x0
#define _TU16BCRL_TU16BCR0_SIZE                             0x1
#define _TU16BCRL_TU16BCR0_LENGTH                           0x1
#define _TU16BCRL_TU16BCR0_MASK                             0x1
#define _TU16BCRL_TU16BCR1_POSN                             0x1
#define _TU16BCRL_TU16BCR1_POSITION                         0x1
#define _TU16BCRL_TU16BCR1_SIZE                             0x1
#define _TU16BCRL_TU16BCR1_LENGTH                           0x1
#define _TU16BCRL_TU16BCR1_MASK                             0x2
#define _TU16BCRL_TU16BCR2_POSN                             0x2
#define _TU16BCRL_TU16BCR2_POSITION                         0x2
#define _TU16BCRL_TU16BCR2_SIZE                             0x1
#define _TU16BCRL_TU16BCR2_LENGTH                           0x1
#define _TU16BCRL_TU16BCR2_MASK                             0x4
#define _TU16BCRL_TU16BCR3_POSN                             0x3
#define _TU16BCRL_TU16BCR3_POSITION                         0x3
#define _TU16BCRL_TU16BCR3_SIZE                             0x1
#define _TU16BCRL_TU16BCR3_LENGTH                           0x1
#define _TU16BCRL_TU16BCR3_MASK                             0x8
#define _TU16BCRL_TU16BCR4_POSN                             0x4
#define _TU16BCRL_TU16BCR4_POSITION                         0x4
#define _TU16BCRL_TU16BCR4_SIZE                             0x1
#define _TU16BCRL_TU16BCR4_LENGTH                           0x1
#define _TU16BCRL_TU16BCR4_MASK                             0x10
#define _TU16BCRL_TU16BCR5_POSN                             0x5
#define _TU16BCRL_TU16BCR5_POSITION                         0x5
#define _TU16BCRL_TU16BCR5_SIZE                             0x1
#define _TU16BCRL_TU16BCR5_LENGTH                           0x1
#define _TU16BCRL_TU16BCR5_MASK                             0x20
#define _TU16BCRL_TU16BCR6_POSN                             0x6
#define _TU16BCRL_TU16BCR6_POSITION                         0x6
#define _TU16BCRL_TU16BCR6_SIZE                             0x1
#define _TU16BCRL_TU16BCR6_LENGTH                           0x1
#define _TU16BCRL_TU16BCR6_MASK                             0x40
#define _TU16BCRL_TU16BCR7_POSN                             0x7
#define _TU16BCRL_TU16BCR7_POSITION                         0x7
#define _TU16BCRL_TU16BCR7_SIZE                             0x1
#define _TU16BCRL_TU16BCR7_LENGTH                           0x1
#define _TU16BCRL_TU16BCR7_MASK                             0x80

// Register: TU16BTMRH
#define TU16BTMRH TU16BTMRH
extern volatile unsigned char           TU16BTMRH           __at(0x13F);
#ifndef _LIB_BUILD
asm("TU16BTMRH equ 013Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRH                   :8;
    };
    struct {
        unsigned TMRH0                  :1;
        unsigned TMRH1                  :1;
        unsigned TMRH2                  :1;
        unsigned TMRH3                  :1;
        unsigned TMRH4                  :1;
        unsigned TMRH5                  :1;
        unsigned TMRH6                  :1;
        unsigned TMRH7                  :1;
    };
    struct {
        unsigned TU16BTMRH0             :1;
        unsigned TU16BTMRH1             :1;
        unsigned TU16BTMRH2             :1;
        unsigned TU16BTMRH3             :1;
        unsigned TU16BTMRH4             :1;
        unsigned TU16BTMRH5             :1;
        unsigned TU16BTMRH6             :1;
        unsigned TU16BTMRH7             :1;
    };
    struct {
        unsigned TU16BTMR8              :1;
        unsigned TU16BTMR9              :1;
        unsigned TU16BTMR10             :1;
        unsigned TU16BTMR11             :1;
        unsigned TU16BTMR12             :1;
        unsigned TU16BTMR13             :1;
        unsigned TU16BTMR14             :1;
        unsigned TU16BTMR15             :1;
    };
} TU16BTMRHbits_t;
extern volatile TU16BTMRHbits_t TU16BTMRHbits __at(0x13F);
// bitfield macros
#define _TU16BTMRH_TMRH_POSN                                0x0
#define _TU16BTMRH_TMRH_POSITION                            0x0
#define _TU16BTMRH_TMRH_SIZE                                0x8
#define _TU16BTMRH_TMRH_LENGTH                              0x8
#define _TU16BTMRH_TMRH_MASK                                0xFF
#define _TU16BTMRH_TMRH0_POSN                               0x0
#define _TU16BTMRH_TMRH0_POSITION                           0x0
#define _TU16BTMRH_TMRH0_SIZE                               0x1
#define _TU16BTMRH_TMRH0_LENGTH                             0x1
#define _TU16BTMRH_TMRH0_MASK                               0x1
#define _TU16BTMRH_TMRH1_POSN                               0x1
#define _TU16BTMRH_TMRH1_POSITION                           0x1
#define _TU16BTMRH_TMRH1_SIZE                               0x1
#define _TU16BTMRH_TMRH1_LENGTH                             0x1
#define _TU16BTMRH_TMRH1_MASK                               0x2
#define _TU16BTMRH_TMRH2_POSN                               0x2
#define _TU16BTMRH_TMRH2_POSITION                           0x2
#define _TU16BTMRH_TMRH2_SIZE                               0x1
#define _TU16BTMRH_TMRH2_LENGTH                             0x1
#define _TU16BTMRH_TMRH2_MASK                               0x4
#define _TU16BTMRH_TMRH3_POSN                               0x3
#define _TU16BTMRH_TMRH3_POSITION                           0x3
#define _TU16BTMRH_TMRH3_SIZE                               0x1
#define _TU16BTMRH_TMRH3_LENGTH                             0x1
#define _TU16BTMRH_TMRH3_MASK                               0x8
#define _TU16BTMRH_TMRH4_POSN                               0x4
#define _TU16BTMRH_TMRH4_POSITION                           0x4
#define _TU16BTMRH_TMRH4_SIZE                               0x1
#define _TU16BTMRH_TMRH4_LENGTH                             0x1
#define _TU16BTMRH_TMRH4_MASK                               0x10
#define _TU16BTMRH_TMRH5_POSN                               0x5
#define _TU16BTMRH_TMRH5_POSITION                           0x5
#define _TU16BTMRH_TMRH5_SIZE                               0x1
#define _TU16BTMRH_TMRH5_LENGTH                             0x1
#define _TU16BTMRH_TMRH5_MASK                               0x20
#define _TU16BTMRH_TMRH6_POSN                               0x6
#define _TU16BTMRH_TMRH6_POSITION                           0x6
#define _TU16BTMRH_TMRH6_SIZE                               0x1
#define _TU16BTMRH_TMRH6_LENGTH                             0x1
#define _TU16BTMRH_TMRH6_MASK                               0x40
#define _TU16BTMRH_TMRH7_POSN                               0x7
#define _TU16BTMRH_TMRH7_POSITION                           0x7
#define _TU16BTMRH_TMRH7_SIZE                               0x1
#define _TU16BTMRH_TMRH7_LENGTH                             0x1
#define _TU16BTMRH_TMRH7_MASK                               0x80
#define _TU16BTMRH_TU16BTMRH0_POSN                          0x0
#define _TU16BTMRH_TU16BTMRH0_POSITION                      0x0
#define _TU16BTMRH_TU16BTMRH0_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH0_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH0_MASK                          0x1
#define _TU16BTMRH_TU16BTMRH1_POSN                          0x1
#define _TU16BTMRH_TU16BTMRH1_POSITION                      0x1
#define _TU16BTMRH_TU16BTMRH1_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH1_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH1_MASK                          0x2
#define _TU16BTMRH_TU16BTMRH2_POSN                          0x2
#define _TU16BTMRH_TU16BTMRH2_POSITION                      0x2
#define _TU16BTMRH_TU16BTMRH2_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH2_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH2_MASK                          0x4
#define _TU16BTMRH_TU16BTMRH3_POSN                          0x3
#define _TU16BTMRH_TU16BTMRH3_POSITION                      0x3
#define _TU16BTMRH_TU16BTMRH3_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH3_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH3_MASK                          0x8
#define _TU16BTMRH_TU16BTMRH4_POSN                          0x4
#define _TU16BTMRH_TU16BTMRH4_POSITION                      0x4
#define _TU16BTMRH_TU16BTMRH4_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH4_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH4_MASK                          0x10
#define _TU16BTMRH_TU16BTMRH5_POSN                          0x5
#define _TU16BTMRH_TU16BTMRH5_POSITION                      0x5
#define _TU16BTMRH_TU16BTMRH5_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH5_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH5_MASK                          0x20
#define _TU16BTMRH_TU16BTMRH6_POSN                          0x6
#define _TU16BTMRH_TU16BTMRH6_POSITION                      0x6
#define _TU16BTMRH_TU16BTMRH6_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH6_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH6_MASK                          0x40
#define _TU16BTMRH_TU16BTMRH7_POSN                          0x7
#define _TU16BTMRH_TU16BTMRH7_POSITION                      0x7
#define _TU16BTMRH_TU16BTMRH7_SIZE                          0x1
#define _TU16BTMRH_TU16BTMRH7_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMRH7_MASK                          0x80
#define _TU16BTMRH_TU16BTMR8_POSN                           0x0
#define _TU16BTMRH_TU16BTMR8_POSITION                       0x0
#define _TU16BTMRH_TU16BTMR8_SIZE                           0x1
#define _TU16BTMRH_TU16BTMR8_LENGTH                         0x1
#define _TU16BTMRH_TU16BTMR8_MASK                           0x1
#define _TU16BTMRH_TU16BTMR9_POSN                           0x1
#define _TU16BTMRH_TU16BTMR9_POSITION                       0x1
#define _TU16BTMRH_TU16BTMR9_SIZE                           0x1
#define _TU16BTMRH_TU16BTMR9_LENGTH                         0x1
#define _TU16BTMRH_TU16BTMR9_MASK                           0x2
#define _TU16BTMRH_TU16BTMR10_POSN                          0x2
#define _TU16BTMRH_TU16BTMR10_POSITION                      0x2
#define _TU16BTMRH_TU16BTMR10_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR10_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR10_MASK                          0x4
#define _TU16BTMRH_TU16BTMR11_POSN                          0x3
#define _TU16BTMRH_TU16BTMR11_POSITION                      0x3
#define _TU16BTMRH_TU16BTMR11_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR11_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR11_MASK                          0x8
#define _TU16BTMRH_TU16BTMR12_POSN                          0x4
#define _TU16BTMRH_TU16BTMR12_POSITION                      0x4
#define _TU16BTMRH_TU16BTMR12_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR12_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR12_MASK                          0x10
#define _TU16BTMRH_TU16BTMR13_POSN                          0x5
#define _TU16BTMRH_TU16BTMR13_POSITION                      0x5
#define _TU16BTMRH_TU16BTMR13_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR13_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR13_MASK                          0x20
#define _TU16BTMRH_TU16BTMR14_POSN                          0x6
#define _TU16BTMRH_TU16BTMR14_POSITION                      0x6
#define _TU16BTMRH_TU16BTMR14_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR14_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR14_MASK                          0x40
#define _TU16BTMRH_TU16BTMR15_POSN                          0x7
#define _TU16BTMRH_TU16BTMR15_POSITION                      0x7
#define _TU16BTMRH_TU16BTMR15_SIZE                          0x1
#define _TU16BTMRH_TU16BTMR15_LENGTH                        0x1
#define _TU16BTMRH_TU16BTMR15_MASK                          0x80

// Register: TU16BCRH
#define TU16BCRH TU16BCRH
extern volatile unsigned char           TU16BCRH            __at(0x13F);
#ifndef _LIB_BUILD
asm("TU16BCRH equ 013Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRH                    :8;
    };
    struct {
        unsigned CRH0                   :1;
        unsigned CRH1                   :1;
        unsigned CRH2                   :1;
        unsigned CRH3                   :1;
        unsigned CRH4                   :1;
        unsigned CRH5                   :1;
        unsigned CRH6                   :1;
        unsigned CRH7                   :1;
    };
    struct {
        unsigned TU16BCRH0              :1;
        unsigned TU16BCRH1              :1;
        unsigned TU16BCRH2              :1;
        unsigned TU16BCRH3              :1;
        unsigned TU16BCRH4              :1;
        unsigned TU16BCRH5              :1;
        unsigned TU16BCRH6              :1;
        unsigned TU16BCRH7              :1;
    };
    struct {
        unsigned TU16BCR8               :1;
        unsigned TU16BCR9               :1;
        unsigned TU16BCR10              :1;
        unsigned TU16BCR11              :1;
        unsigned TU16BCR12              :1;
        unsigned TU16BCR13              :1;
        unsigned TU16BCR14              :1;
        unsigned TU16BCR15              :1;
    };
} TU16BCRHbits_t;
