garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile U2CON0bits_t U2CON0bits __at(0x1CD);
// bitfield macros
#define _U2CON0_MODE0_POSN                                  0x0
#define _U2CON0_MODE0_POSITION                              0x0
#define _U2CON0_MODE0_SIZE                                  0x1
#define _U2CON0_MODE0_LENGTH                                0x1
#define _U2CON0_MODE0_MASK                                  0x1
#define _U2CON0_MODE1_POSN                                  0x1
#define _U2CON0_MODE1_POSITION                              0x1
#define _U2CON0_MODE1_SIZE                                  0x1
#define _U2CON0_MODE1_LENGTH                                0x1
#define _U2CON0_MODE1_MASK                                  0x2
#define _U2CON0_MODE2_POSN                                  0x2
#define _U2CON0_MODE2_POSITION                              0x2
#define _U2CON0_MODE2_SIZE                                  0x1
#define _U2CON0_MODE2_LENGTH                                0x1
#define _U2CON0_MODE2_MASK                                  0x4
#define _U2CON0_U2MODE_POSN                                 0x0
#define _U2CON0_U2MODE_POSITION                             0x0
#define _U2CON0_U2MODE_SIZE                                 0x4
#define _U2CON0_U2MODE_LENGTH                               0x4
#define _U2CON0_U2MODE_MASK                                 0xF
#define _U2CON0_U2RXEN_POSN                                 0x4
#define _U2CON0_U2RXEN_POSITION                             0x4
#define _U2CON0_U2RXEN_SIZE                                 0x1
#define _U2CON0_U2RXEN_LENGTH                               0x1
#define _U2CON0_U2RXEN_MASK                                 0x10
#define _U2CON0_U2TXEN_POSN                                 0x5
#define _U2CON0_U2TXEN_POSITION                             0x5
#define _U2CON0_U2TXEN_SIZE                                 0x1
#define _U2CON0_U2TXEN_LENGTH                               0x1
#define _U2CON0_U2TXEN_MASK                                 0x20
#define _U2CON0_U2ABDEN_POSN                                0x6
#define _U2CON0_U2ABDEN_POSITION                            0x6
#define _U2CON0_U2ABDEN_SIZE                                0x1
#define _U2CON0_U2ABDEN_LENGTH                              0x1
#define _U2CON0_U2ABDEN_MASK                                0x40
#define _U2CON0_U2BRGS_POSN                                 0x7
#define _U2CON0_U2BRGS_POSITION                             0x7
#define _U2CON0_U2BRGS_SIZE                                 0x1
#define _U2CON0_U2BRGS_LENGTH                               0x1
#define _U2CON0_U2BRGS_MASK                                 0x80
#define _U2CON0_U2MODE0_POSN                                0x0
#define _U2CON0_U2MODE0_POSITION                            0x0
#define _U2CON0_U2MODE0_SIZE                                0x1
#define _U2CON0_U2MODE0_LENGTH                              0x1
#define _U2CON0_U2MODE0_MASK                                0x1
#define _U2CON0_U2MODE1_POSN                                0x1
#define _U2CON0_U2MODE1_POSITION                            0x1
#define _U2CON0_U2MODE1_SIZE                                0x1
#define _U2CON0_U2MODE1_LENGTH                              0x1
#define _U2CON0_U2MODE1_MASK                                0x2
#define _U2CON0_U2MODE2_POSN                                0x2
#define _U2CON0_U2MODE2_POSITION                            0x2
#define _U2CON0_U2MODE2_SIZE                                0x1
#define _U2CON0_U2MODE2_LENGTH                              0x1
#define _U2CON0_U2MODE2_MASK                                0x4
#define _U2CON0_MODE_POSN                                   0x0
#define _U2CON0_MODE_POSITION                               0x0
#define _U2CON0_MODE_SIZE                                   0x4
#define _U2CON0_MODE_LENGTH                                 0x4
#define _U2CON0_MODE_MASK                                   0xF
#define _U2CON0_RXEN_POSN                                   0x4
#define _U2CON0_RXEN_POSITION                               0x4
#define _U2CON0_RXEN_SIZE                                   0x1
#define _U2CON0_RXEN_LENGTH                                 0x1
#define _U2CON0_RXEN_MASK                                   0x10
#define _U2CON0_TXEN_POSN                                   0x5
#define _U2CON0_TXEN_POSITION                               0x5
#define _U2CON0_TXEN_SIZE                                   0x1
#define _U2CON0_TXEN_LENGTH                                 0x1
#define _U2CON0_TXEN_MASK                                   0x20
#define _U2CON0_ABDEN_POSN                                  0x6
#define _U2CON0_ABDEN_POSITION                              0x6
#define _U2CON0_ABDEN_SIZE                                  0x1
#define _U2CON0_ABDEN_LENGTH                                0x1
#define _U2CON0_ABDEN_MASK                                  0x40
#define _U2CON0_BRGS_POSN                                   0x7
#define _U2CON0_BRGS_POSITION                               0x7
#define _U2CON0_BRGS_SIZE                                   0x1
#define _U2CON0_BRGS_LENGTH                                 0x1
#define _U2CON0_BRGS_MASK                                   0x80

// Register: U2CON1
#define U2CON1 U2CON1
extern volatile unsigned char           U2CON1              __at(0x1CE);
#ifndef _LIB_BUILD
asm("U2CON1 equ 01CEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U2SENDB                :1;
        unsigned U2BRKOVR               :1;
        unsigned                        :1;
        unsigned U2RXBIMD               :1;
        unsigned U2WUE                  :1;
        unsigned                        :2;
        unsigned U2ON                   :1;
    };
} U2CON1bits_t;
extern volatile U2CON1bits_t U2CON1bits __at(0x1CE);
// bitfield macros
#define _U2CON1_SENDB_POSN                                  0x0
#define _U2CON1_SENDB_POSITION                              0x0
#define _U2CON1_SENDB_SIZE                                  0x1
#define _U2CON1_SENDB_LENGTH                                0x1
#define _U2CON1_SENDB_MASK                                  0x1
#define _U2CON1_BRKOVR_POSN                                 0x1
#define _U2CON1_BRKOVR_POSITION                             0x1
#define _U2CON1_BRKOVR_SIZE                                 0x1
#define _U2CON1_BRKOVR_LENGTH                               0x1
#define _U2CON1_BRKOVR_MASK                                 0x2
#define _U2CON1_RXBIMD_POSN                                 0x3
#define _U2CON1_RXBIMD_POSITION                             0x3
#define _U2CON1_RXBIMD_SIZE                                 0x1
#define _U2CON1_RXBIMD_LENGTH                               0x1
#define _U2CON1_RXBIMD_MASK                                 0x8
#define _U2CON1_WUE_POSN                                    0x4
#define _U2CON1_WUE_POSITION                                0x4
#define _U2CON1_WUE_SIZE                                    0x1
#define _U2CON1_WUE_LENGTH                                  0x1
#define _U2CON1_WUE_MASK                                    0x10
#define _U2CON1_ON_POSN                                     0x7
#define _U2CON1_ON_POSITION                                 0x7
#define _U2CON1_ON_SIZE                                     0x1
#define _U2CON1_ON_LENGTH                                   0x1
#define _U2CON1_ON_MASK                                     0x80
#define _U2CON1_U2SENDB_POSN                                0x0
#define _U2CON1_U2SENDB_POSITION                            0x0
#define _U2CON1_U2SENDB_SIZE                                0x1
#define _U2CON1_U2SENDB_LENGTH                              0x1
#define _U2CON1_U2SENDB_MASK                                0x1
#define _U2CON1_U2BRKOVR_POSN                               0x1
#define _U2CON1_U2BRKOVR_POSITION                           0x1
#define _U2CON1_U2BRKOVR_SIZE                               0x1
#define _U2CON1_U2BRKOVR_LENGTH                             0x1
#define _U2CON1_U2BRKOVR_MASK                               0x2
#define _U2CON1_U2RXBIMD_POSN                               0x3
#define _U2CON1_U2RXBIMD_POSITION                           0x3
#define _U2CON1_U2RXBIMD_SIZE                               0x1
#define _U2CON1_U2RXBIMD_LENGTH                             0x1
#define _U2CON1_U2RXBIMD_MASK                               0x8
#define _U2CON1_U2WUE_POSN                                  0x4
#define _U2CON1_U2WUE_POSITION                              0x4
#define _U2CON1_U2WUE_SIZE                                  0x1
#define _U2CON1_U2WUE_LENGTH                                0x1
#define _U2CON1_U2WUE_MASK                                  0x10
#define _U2CON1_U2ON_POSN                                   0x7
#define _U2CON1_U2ON_POSITION                               0x7
#define _U2CON1_U2ON_SIZE                                   0x1
#define _U2CON1_U2ON_LENGTH                                 0x1
#define _U2CON1_U2ON_MASK                                   0x80

// Register: U2CON2
#define U2CON2 U2CON2
extern volatile unsigned char           U2CON2              __at(0x1CF);
#ifndef _LIB_BUILD
asm("U2CON2 equ 01CFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned                        :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U2FLO                  :2;
        unsigned U2TXPOL                :1;
        unsigned                        :1;
        unsigned U2STP                  :2;
        unsigned U2RXPOL                :1;
        unsigned U2RUNOVF               :1;
    };
    struct {
        unsigned U2FLO0                 :1;
        unsigned U2FLO1                 :1;
        unsigned                        :2;
        unsigned U2STP0                 :1;
        unsigned U2STP1                 :1;
    };
} U2CON2bits_t;
extern volatile U2CON2bits_t U2CON2bits __at(0x1CF);
// bitfield macros
#define _U2CON2_FLO_POSN                                    0x0
#define _U2CON2_FLO_POSITION                                0x0
#define _U2CON2_FLO_SIZE                                    0x2
#define _U2CON2_FLO_LENGTH                                  0x2
#define _U2CON2_FLO_MASK                                    0x3
#define _U2CON2_TXPOL_POSN                                  0x2
#define _U2CON2_TXPOL_POSITION                              0x2
#define _U2CON2_TXPOL_SIZE                                  0x1
#define _U2CON2_TXPOL_LENGTH                                0x1
#define _U2CON2_TXPOL_MASK                                  0x4
#define _U2CON2_STP_POSN                                    0x4
#define _U2CON2_STP_POSITION                                0x4
#define _U2CON2_STP_SIZE                                    0x2
#define _U2CON2_STP_LENGTH                                  0x2
#define _U2CON2_STP_MASK                                    0x30
#define _U2CON2_RXPOL_POSN                                  0x6
#define _U2CON2_RXPOL_POSITION                              0x6
#define _U2CON2_RXPOL_SIZE                                  0x1
#define _U2CON2_RXPOL_LENGTH                                0x1
#define _U2CON2_RXPOL_MASK                                  0x40
#define _U2CON2_RUNOVF_POSN                                 0x7
#define _U2CON2_RUNOVF_POSITION                             0x7
#define _U2CON2_RUNOVF_SIZE                                 0x1
#define _U2CON2_RUNOVF_LENGTH                               0x1
#define _U2CON2_RUNOVF_MASK                                 0x80
#define _U2CON2_FLO0_POSN                                   0x0
#define _U2CON2_FLO0_POSITION                               0x0
#define _U2CON2_FLO0_SIZE                                   0x1
#define _U2CON2_FLO0_LENGTH                                 0x1
#define _U2CON2_FLO0_MASK                                   0x1
#define _U2CON2_FLO1_POSN                                   0x1
#define _U2CON2_FLO1_POSITION                               0x1
#define _U2CON2_FLO1_SIZE                                   0x1
#define _U2CON2_FLO1_LENGTH                                 0x1
#define _U2CON2_FLO1_MASK                                   0x2
#define _U2CON2_STP0_POSN                                   0x4
#define _U2CON2_STP0_POSITION                               0x4
#define _U2CON2_STP0_SIZE                                   0x1
#define _U2CON2_STP0_LENGTH                                 0x1
#define _U2CON2_STP0_MASK                                   0x10
#define _U2CON2_STP1_POSN                                   0x5
#define _U2CON2_STP1_POSITION                               0x5
#define _U2CON2_STP1_SIZE                                   0x1
#define _U2CON2_STP1_LENGTH                                 0x1
#define _U2CON2_STP1_MASK                                   0x20
#define _U2CON2_U2FLO_POSN                                  0x0
#define _U2CON2_U2FLO_POSITION                              0x0
#define _U2CON2_U2FLO_SIZE                                  0x2
#define _U2CON2_U2FLO_LENGTH                                0x2
#define _U2CON2_U2FLO_MASK                                  0x3
#define _U2CON2_U2TXPOL_POSN                                0x2
#define _U2CON2_U2TXPOL_POSITION                            0x2
#define _U2CON2_U2TXPOL_SIZE                                0x1
#define _U2CON2_U2TXPOL_LENGTH                              0x1
#define _U2CON2_U2TXPOL_MASK                                0x4
#define _U2CON2_U2STP_POSN                                  0x4
#define _U2CON2_U2STP_POSITION                              0x4
#define _U2CON2_U2STP_SIZE                                  0x2
#define _U2CON2_U2STP_LENGTH                                0x2
#define _U2CON2_U2STP_MASK                                  0x30
#define _U2CON2_U2RXPOL_POSN                                0x6
#define _U2CON2_U2RXPOL_POSITION                            0x6
#define _U2CON2_U2RXPOL_SIZE                                0x1
#define _U2CON2_U2RXPOL_LENGTH                              0x1
#define _U2CON2_U2RXPOL_MASK                                0x40
#define _U2CON2_U2RUNOVF_POSN                               0x7
#define _U2CON2_U2RUNOVF_POSITION                           0x7
#define _U2CON2_U2RUNOVF_SIZE                               0x1
#define _U2CON2_U2RUNOVF_LENGTH                             0x1
#define _U2CON2_U2RUNOVF_MASK                               0x80
#define _U2CON2_U2FLO0_POSN                                 0x0
#define _U2CON2_U2FLO0_POSITION                             0x0
#define _U2CON2_U2FLO0_SIZE                                 0x1
#define _U2CON2_U2FLO0_LENGTH                               0x1
#define _U2CON2_U2FLO0_MASK                                 0x1
#define _U2CON2_U2FLO1_POSN                                 0x1
#define _U2CON2_U2FLO1_POSITION                             0x1
#define _U2CON2_U2FLO1_SIZE                                 0x1
#define _U2CON2_U2FLO1_LENGTH                               0x1
#define _U2CON2_U2FLO1_MASK                                 0x2
#define _U2CON2_U2STP0_POSN                                 0x4
#define _U2CON2_U2STP0_POSITION                             0x4
#define _U2CON2_U2STP0_SIZE                                 0x1
#define _U2CON2_U2STP0_LENGTH                               0x1
#define _U2CON2_U2STP0_MASK                                 0x10
#define _U2CON2_U2STP1_POSN                                 0x5
#define _U2CON2_U2STP1_POSITION                             0x5
#define _U2CON2_U2STP1_SIZE                                 0x1
#define _U2CON2_U2STP1_LENGTH                               0x1
#define _U2CON2_U2STP1_MASK                                 0x20

// Register: U2BRG
#define U2BRG U2BRG
extern volatile unsigned short          U2BRG               __at(0x1D0);
#ifndef _LIB_BUILD
asm("U2BRG equ 01D0h");
#endif

// Register: U2BRGL
#define U2BRGL U2BRGL
extern volatile unsigned char           U2BRGL              __at(0x1D0);
#ifndef _LIB_BUILD
asm("U2BRGL equ 01D0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U2BRGLbits_t;
extern volatile U2BRGLbits_t U2BRGLbits __at(0x1D0);
// bitfield macros
#define _U2BRGL_BRGL_POSN                                   0x0
#define _U2BRGL_BRGL_POSITION                               0x0
#define _U2BRGL_BRGL_SIZE                                   0x8
#define _U2BRGL_BRGL_LENGTH                                 0x8
#define _U2BRGL_BRGL_MASK                                   0xFF

// Register: U2BRGH
#define U2BRGH U2BRGH
extern volatile unsigned char           U2BRGH              __at(0x1D1);
#ifndef _LIB_BUILD
asm("U2BRGH equ 01D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U2BRGHbits_t;
extern volatile U2BRGHbits_t U2BRGHbits __at(0x1D1);
// bitfield macros
#define _U2BRGH_BRGH_POSN                                   0x0
#define _U2BRGH_BRGH_POSITION                               0x0
#define _U2BRGH_BRGH_SIZE                                   0x8
#define _U2BRGH_BRGH_LENGTH                                 0x8
#define _U2BRGH_BRGH_MASK                                   0xFF

// Register: U2FIFO
#define U2FIFO U2FIFO
extern volatile unsigned char           U2FIFO              __at(0x1D2);
#ifndef _LIB_BUILD
asm("U2FIFO equ 01D2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U2RXBF                 :1;
        unsigned U2RXBE                 :1;
        unsigned U2XON                  :1;
        unsigned U2RXIDL                :1;
        unsigned U2TXBF                 :1;
        unsigned U2TXBE                 :1;
        unsigned U2STPMD                :1;
        unsigned U2TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U2RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U2FIFObits_t;
