garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x302);
#ifndef _LIB_BUILD
asm("PMD2 equ 0302h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TU16AMD                :1;
        unsigned TU16BMD                :1;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned PWM1MD                 :1;
        unsigned PWM2MD                 :1;
        unsigned CWG1MD                 :1;
        unsigned CLC1MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x302);
// bitfield macros
#define _PMD2_TU16AMD_POSN                                  0x0
#define _PMD2_TU16AMD_POSITION                              0x0
#define _PMD2_TU16AMD_SIZE                                  0x1
#define _PMD2_TU16AMD_LENGTH                                0x1
#define _PMD2_TU16AMD_MASK                                  0x1
#define _PMD2_TU16BMD_POSN                                  0x1
#define _PMD2_TU16BMD_POSITION                              0x1
#define _PMD2_TU16BMD_SIZE                                  0x1
#define _PMD2_TU16BMD_LENGTH                                0x1
#define _PMD2_TU16BMD_MASK                                  0x2
#define _PMD2_CCP1MD_POSN                                   0x2
#define _PMD2_CCP1MD_POSITION                               0x2
#define _PMD2_CCP1MD_SIZE                                   0x1
#define _PMD2_CCP1MD_LENGTH                                 0x1
#define _PMD2_CCP1MD_MASK                                   0x4
#define _PMD2_CCP2MD_POSN                                   0x3
#define _PMD2_CCP2MD_POSITION                               0x3
#define _PMD2_CCP2MD_SIZE                                   0x1
#define _PMD2_CCP2MD_LENGTH                                 0x1
#define _PMD2_CCP2MD_MASK                                   0x8
#define _PMD2_PWM1MD_POSN                                   0x4
#define _PMD2_PWM1MD_POSITION                               0x4
#define _PMD2_PWM1MD_SIZE                                   0x1
#define _PMD2_PWM1MD_LENGTH                                 0x1
#define _PMD2_PWM1MD_MASK                                   0x10
#define _PMD2_PWM2MD_POSN                                   0x5
#define _PMD2_PWM2MD_POSITION                               0x5
#define _PMD2_PWM2MD_SIZE                                   0x1
#define _PMD2_PWM2MD_LENGTH                                 0x1
#define _PMD2_PWM2MD_MASK                                   0x20
#define _PMD2_CWG1MD_POSN                                   0x6
#define _PMD2_CWG1MD_POSITION                               0x6
#define _PMD2_CWG1MD_SIZE                                   0x1
#define _PMD2_CWG1MD_LENGTH                                 0x1
#define _PMD2_CWG1MD_MASK                                   0x40
#define _PMD2_CLC1MD_POSN                                   0x7
#define _PMD2_CLC1MD_POSITION                               0x7
#define _PMD2_CLC1MD_SIZE                                   0x1
#define _PMD2_CLC1MD_LENGTH                                 0x1
#define _PMD2_CLC1MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x303);
#ifndef _LIB_BUILD
asm("PMD3 equ 0303h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
        unsigned SPI1MD                 :1;
        unsigned I2C1MD                 :1;
        unsigned I3C1MD                 :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x303);
// bitfield macros
#define _PMD3_CLC2MD_POSN                                   0x0
#define _PMD3_CLC2MD_POSITION                               0x0
#define _PMD3_CLC2MD_SIZE                                   0x1
#define _PMD3_CLC2MD_LENGTH                                 0x1
#define _PMD3_CLC2MD_MASK                                   0x1
#define _PMD3_CLC3MD_POSN                                   0x1
#define _PMD3_CLC3MD_POSITION                               0x1
#define _PMD3_CLC3MD_SIZE                                   0x1
#define _PMD3_CLC3MD_LENGTH                                 0x1
#define _PMD3_CLC3MD_MASK                                   0x2
#define _PMD3_CLC4MD_POSN                                   0x2
#define _PMD3_CLC4MD_POSITION                               0x2
#define _PMD3_CLC4MD_SIZE                                   0x1
#define _PMD3_CLC4MD_LENGTH                                 0x1
#define _PMD3_CLC4MD_MASK                                   0x4
#define _PMD3_U1MD_POSN                                     0x3
#define _PMD3_U1MD_POSITION                                 0x3
#define _PMD3_U1MD_SIZE                                     0x1
#define _PMD3_U1MD_LENGTH                                   0x1
#define _PMD3_U1MD_MASK                                     0x8
#define _PMD3_U2MD_POSN                                     0x4
#define _PMD3_U2MD_POSITION                                 0x4
#define _PMD3_U2MD_SIZE                                     0x1
#define _PMD3_U2MD_LENGTH                                   0x1
#define _PMD3_U2MD_MASK                                     0x10
#define _PMD3_SPI1MD_POSN                                   0x5
#define _PMD3_SPI1MD_POSITION                               0x5
#define _PMD3_SPI1MD_SIZE                                   0x1
#define _PMD3_SPI1MD_LENGTH                                 0x1
#define _PMD3_SPI1MD_MASK                                   0x20
#define _PMD3_I2C1MD_POSN                                   0x6
#define _PMD3_I2C1MD_POSITION                               0x6
#define _PMD3_I2C1MD_SIZE                                   0x1
#define _PMD3_I2C1MD_LENGTH                                 0x1
#define _PMD3_I2C1MD_MASK                                   0x40
#define _PMD3_I3C1MD_POSN                                   0x7
#define _PMD3_I3C1MD_POSITION                               0x7
#define _PMD3_I3C1MD_SIZE                                   0x1
#define _PMD3_I3C1MD_LENGTH                                 0x1
#define _PMD3_I3C1MD_MASK                                   0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x304);
#ifndef _LIB_BUILD
asm("PMD4 equ 0304h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned FVRMD                  :1;
        unsigned HLVDMD                 :1;
        unsigned ADCMD                  :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x304);
// bitfield macros
#define _PMD4_FVRMD_POSN                                    0x1
#define _PMD4_FVRMD_POSITION                                0x1
#define _PMD4_FVRMD_SIZE                                    0x1
#define _PMD4_FVRMD_LENGTH                                  0x1
#define _PMD4_FVRMD_MASK                                    0x2
#define _PMD4_HLVDMD_POSN                                   0x2
#define _PMD4_HLVDMD_POSITION                               0x2
#define _PMD4_HLVDMD_SIZE                                   0x1
#define _PMD4_HLVDMD_LENGTH                                 0x1
#define _PMD4_HLVDMD_MASK                                   0x4
#define _PMD4_ADCMD_POSN                                    0x3
#define _PMD4_ADCMD_POSITION                                0x3
#define _PMD4_ADCMD_SIZE                                    0x1
#define _PMD4_ADCMD_LENGTH                                  0x1
#define _PMD4_ADCMD_MASK                                    0x8

// Register: RC0FEAT
#define RC0FEAT RC0FEAT
extern volatile unsigned char           RC0FEAT             __at(0x312);
#ifndef _LIB_BUILD
asm("RC0FEAT equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYSBUF                 :3;
        unsigned I3CBUF                 :3;
        unsigned SLEW                   :2;
    };
} RC0FEATbits_t;
extern volatile RC0FEATbits_t RC0FEATbits __at(0x312);
// bitfield macros
#define _RC0FEAT_SYSBUF_POSN                                0x0
#define _RC0FEAT_SYSBUF_POSITION                            0x0
#define _RC0FEAT_SYSBUF_SIZE                                0x3
#define _RC0FEAT_SYSBUF_LENGTH                              0x3
#define _RC0FEAT_SYSBUF_MASK                                0x7
#define _RC0FEAT_I3CBUF_POSN                                0x3
#define _RC0FEAT_I3CBUF_POSITION                            0x3
#define _RC0FEAT_I3CBUF_SIZE                                0x3
#define _RC0FEAT_I3CBUF_LENGTH                              0x3
#define _RC0FEAT_I3CBUF_MASK                                0x38
#define _RC0FEAT_SLEW_POSN                                  0x6
#define _RC0FEAT_SLEW_POSITION                              0x6
#define _RC0FEAT_SLEW_SIZE                                  0x2
#define _RC0FEAT_SLEW_LENGTH                                0x2
#define _RC0FEAT_SLEW_MASK                                  0xC0

// Register: RC1FEAT
#define RC1FEAT RC1FEAT
extern volatile unsigned char           RC1FEAT             __at(0x313);
#ifndef _LIB_BUILD
asm("RC1FEAT equ 0313h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYSBUF                 :3;
        unsigned I3CBUF                 :3;
        unsigned SLEW                   :2;
    };
} RC1FEATbits_t;
