garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile U1CTSPPSbits_t U1CTSPPSbits __at(0x3A1);
// bitfield macros
#define _U1CTSPPS_U1CTSPPS_POSN                             0x0
#define _U1CTSPPS_U1CTSPPS_POSITION                         0x0
#define _U1CTSPPS_U1CTSPPS_SIZE                             0x5
#define _U1CTSPPS_U1CTSPPS_LENGTH                           0x5
#define _U1CTSPPS_U1CTSPPS_MASK                             0x1F
#define _U1CTSPPS_U1CTSPPS0_POSN                            0x0
#define _U1CTSPPS_U1CTSPPS0_POSITION                        0x0
#define _U1CTSPPS_U1CTSPPS0_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS0_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS0_MASK                            0x1
#define _U1CTSPPS_U1CTSPPS1_POSN                            0x1
#define _U1CTSPPS_U1CTSPPS1_POSITION                        0x1
#define _U1CTSPPS_U1CTSPPS1_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS1_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS1_MASK                            0x2
#define _U1CTSPPS_U1CTSPPS2_POSN                            0x2
#define _U1CTSPPS_U1CTSPPS2_POSITION                        0x2
#define _U1CTSPPS_U1CTSPPS2_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS2_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS2_MASK                            0x4
#define _U1CTSPPS_U1CTSPPS3_POSN                            0x3
#define _U1CTSPPS_U1CTSPPS3_POSITION                        0x3
#define _U1CTSPPS_U1CTSPPS3_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS3_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS3_MASK                            0x8
#define _U1CTSPPS_U1CTSPPS4_POSN                            0x4
#define _U1CTSPPS_U1CTSPPS4_POSITION                        0x4
#define _U1CTSPPS_U1CTSPPS4_SIZE                            0x1
#define _U1CTSPPS_U1CTSPPS4_LENGTH                          0x1
#define _U1CTSPPS_U1CTSPPS4_MASK                            0x10

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
extern volatile unsigned char           U1RXPPS             __at(0x3A2);
#ifndef _LIB_BUILD
asm("U1RXPPS equ 03A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXPPS                :5;
    };
    struct {
        unsigned U1RXPPS0               :1;
        unsigned U1RXPPS1               :1;
        unsigned U1RXPPS2               :1;
        unsigned U1RXPPS3               :1;
        unsigned U1RXPPS4               :1;
    };
} U1RXPPSbits_t;
extern volatile U1RXPPSbits_t U1RXPPSbits __at(0x3A2);
// bitfield macros
#define _U1RXPPS_U1RXPPS_POSN                               0x0
#define _U1RXPPS_U1RXPPS_POSITION                           0x0
#define _U1RXPPS_U1RXPPS_SIZE                               0x5
#define _U1RXPPS_U1RXPPS_LENGTH                             0x5
#define _U1RXPPS_U1RXPPS_MASK                               0x1F
#define _U1RXPPS_U1RXPPS0_POSN                              0x0
#define _U1RXPPS_U1RXPPS0_POSITION                          0x0
#define _U1RXPPS_U1RXPPS0_SIZE                              0x1
#define _U1RXPPS_U1RXPPS0_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS0_MASK                              0x1
#define _U1RXPPS_U1RXPPS1_POSN                              0x1
#define _U1RXPPS_U1RXPPS1_POSITION                          0x1
#define _U1RXPPS_U1RXPPS1_SIZE                              0x1
#define _U1RXPPS_U1RXPPS1_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS1_MASK                              0x2
#define _U1RXPPS_U1RXPPS2_POSN                              0x2
#define _U1RXPPS_U1RXPPS2_POSITION                          0x2
#define _U1RXPPS_U1RXPPS2_SIZE                              0x1
#define _U1RXPPS_U1RXPPS2_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS2_MASK                              0x4
#define _U1RXPPS_U1RXPPS3_POSN                              0x3
#define _U1RXPPS_U1RXPPS3_POSITION                          0x3
#define _U1RXPPS_U1RXPPS3_SIZE                              0x1
#define _U1RXPPS_U1RXPPS3_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS3_MASK                              0x8
#define _U1RXPPS_U1RXPPS4_POSN                              0x4
#define _U1RXPPS_U1RXPPS4_POSITION                          0x4
#define _U1RXPPS_U1RXPPS4_SIZE                              0x1
#define _U1RXPPS_U1RXPPS4_LENGTH                            0x1
#define _U1RXPPS_U1RXPPS4_MASK                              0x10

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
extern volatile unsigned char           U2CTSPPS            __at(0x3A3);
#ifndef _LIB_BUILD
asm("U2CTSPPS equ 03A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2CTSPPS               :5;
    };
    struct {
        unsigned U2CTSPPS0              :1;
        unsigned U2CTSPPS1              :1;
        unsigned U2CTSPPS2              :1;
        unsigned U2CTSPPS3              :1;
        unsigned U2CTSPPS4              :1;
    };
} U2CTSPPSbits_t;
extern volatile U2CTSPPSbits_t U2CTSPPSbits __at(0x3A3);
// bitfield macros
#define _U2CTSPPS_U2CTSPPS_POSN                             0x0
#define _U2CTSPPS_U2CTSPPS_POSITION                         0x0
#define _U2CTSPPS_U2CTSPPS_SIZE                             0x5
#define _U2CTSPPS_U2CTSPPS_LENGTH                           0x5
#define _U2CTSPPS_U2CTSPPS_MASK                             0x1F
#define _U2CTSPPS_U2CTSPPS0_POSN                            0x0
#define _U2CTSPPS_U2CTSPPS0_POSITION                        0x0
#define _U2CTSPPS_U2CTSPPS0_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS0_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS0_MASK                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSN                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSITION                        0x1
#define _U2CTSPPS_U2CTSPPS1_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS1_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS1_MASK                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSN                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSITION                        0x2
#define _U2CTSPPS_U2CTSPPS2_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS2_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS2_MASK                            0x4
#define _U2CTSPPS_U2CTSPPS3_POSN                            0x3
#define _U2CTSPPS_U2CTSPPS3_POSITION                        0x3
#define _U2CTSPPS_U2CTSPPS3_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS3_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS3_MASK                            0x8
#define _U2CTSPPS_U2CTSPPS4_POSN                            0x4
#define _U2CTSPPS_U2CTSPPS4_POSITION                        0x4
#define _U2CTSPPS_U2CTSPPS4_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS4_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS4_MASK                            0x10

