garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern const unsigned short             _DIA_EUI[10]        __at(0x2C0010);
#define DIA_EUI                                             0x2C0010
extern const unsigned short             _DIA_EUI0           __at(0x2C0010);
#define DIA_EUI0                                            0x2C0010
extern const unsigned short             _DIA_EUI1           __at(0x2C0012);
#define DIA_EUI1                                            0x2C0012
extern const unsigned short             _DIA_EUI2           __at(0x2C0014);
#define DIA_EUI2                                            0x2C0014
extern const unsigned short             _DIA_EUI3           __at(0x2C0016);
#define DIA_EUI3                                            0x2C0016
extern const unsigned short             _DIA_EUI4           __at(0x2C0018);
#define DIA_EUI4                                            0x2C0018
extern const unsigned short             _DIA_EUI5           __at(0x2C001A);
#define DIA_EUI5                                            0x2C001A
extern const unsigned short             _DIA_EUI6           __at(0x2C001C);
#define DIA_EUI6                                            0x2C001C
extern const unsigned short             _DIA_EUI7           __at(0x2C001E);
#define DIA_EUI7                                            0x2C001E
extern const unsigned short             _DIA_EUI8           __at(0x2C0020);
#define DIA_EUI8                                            0x2C0020
extern const unsigned short             _DIA_EUI9           __at(0x2C0022);
#define DIA_EUI9                                            0x2C0022

extern const unsigned short             _DIA_TSLR[3]        __at(0x2C0024);
#define DIA_TSLR                                            0x2C0024
extern const unsigned short             _DIA_TSLR1          __at(0x2C0024);
#define DIA_TSLR1                                           0x2C0024
extern const unsigned short             _DIA_TSLR2          __at(0x2C0026);
#define DIA_TSLR2                                           0x2C0026
extern const unsigned short             _DIA_TSLR3          __at(0x2C0028);
#define DIA_TSLR3                                           0x2C0028

extern const unsigned short             _DIA_TSHR[3]        __at(0x2C002A);
#define DIA_TSHR                                            0x2C002A
extern const unsigned short             _DIA_TSHR1          __at(0x2C002A);
#define DIA_TSHR1                                           0x2C002A
extern const unsigned short             _DIA_TSHR2          __at(0x2C002C);
#define DIA_TSHR2                                           0x2C002C
extern const unsigned short             _DIA_TSHR3          __at(0x2C002E);
#define DIA_TSHR3                                           0x2C002E

extern const unsigned short             _DIA_FVRA[3]        __at(0x2C0030);
#define DIA_FVRA                                            0x2C0030
extern const unsigned short             _DIA_FVRA1X         __at(0x2C0030);
#define DIA_FVRA1X                                          0x2C0030
extern const unsigned short             _DIA_FVRA2X         __at(0x2C0032);
#define DIA_FVRA2X                                          0x2C0032
extern const unsigned short             _DIA_FVRA4X         __at(0x2C0034);
#define DIA_FVRA4X                                          0x2C0034

extern const unsigned short             _DIA_FVRC[3]        __at(0x2C0036);
#define DIA_FVRC                                            0x2C0036
extern const unsigned short             _DIA_FVRC1X         __at(0x2C0036);
#define DIA_FVRC1X                                          0x2C0036
extern const unsigned short             _DIA_FVRC2X         __at(0x2C0038);
#define DIA_FVRC2X                                          0x2C0038
extern const unsigned short             _DIA_FVRC4X         __at(0x2C003A);
#define DIA_FVRC4X                                          0x2C003A

/*
 * Device Configuration Information (DCI) Table
 */
extern const unsigned char              _DCI[10]            __at(0x3C0000);

extern const unsigned short             _DCI_ERSIZ          __at(0x3C0000);
#define DCI_ERSIZ                                           0x3C0000
extern const unsigned short             _DCI_WLSIZ          __at(0x3C0002);
#define DCI_WLSIZ                                           0x3C0002
extern const unsigned short             _DCI_URSIZ          __at(0x3C0004);
#define DCI_URSIZ                                           0x3C0004
extern const unsigned short             _DCI_EESIZ          __at(0x3C0006);
#define DCI_EESIZ                                           0x3C0006
extern const unsigned short             _DCI_PCNT           __at(0x3C0008);
#define DCI_PCNT                                            0x3C0008

/*
 * Configuration and ID Registers
 */
extern const unsigned char              _CONFIGs[26]        __at(0x300000);
// Register: CONFIG1
extern const unsigned char              _CONFIG1            __at(0x300000);
// bitfield definitions
typedef union {
    struct {
        unsigned FEXTOSC                :3;
        unsigned                        :1;
        unsigned RSTOSC                 :3;
    };
} _CONFIG1bits_t;
extern const _CONFIG1bits_t _CONFIG1bits __at(0x300000);

// Register: CONFIG2
extern const unsigned char              _CONFIG2            __at(0x300001);
// bitfield definitions
typedef union {
    struct {
        unsigned CLKOUTEN               :1;
        unsigned PR1WAY                 :1;
        unsigned BBEN                   :1;
        unsigned CSWEN                  :1;
        unsigned                        :1;
        unsigned FCMEN                  :1;
        unsigned FCMENP                 :1;
        unsigned FCMENS                 :1;
    };
} _CONFIG2bits_t;
extern const _CONFIG2bits_t _CONFIG2bits __at(0x300001);

// Register: CONFIG3
extern const unsigned char              _CONFIG3            __at(0x300002);
// bitfield definitions
typedef union {
    struct {
        unsigned MCLRE                  :1;
        unsigned PWRTS                  :2;
        unsigned MVECEN                 :1;
        unsigned IVT1WAY                :1;
        unsigned LPBOREN                :1;
        unsigned BOREN                  :2;
    };
} _CONFIG3bits_t;
