garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
extern volatile __bit                   INTL                __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// CLCnCON<INTN>
extern volatile __bit                   INTN                __at(0xD2B);	// @ (0x1A5 * 8 + 3)
#define                                 INTN_bit            _BIT_ACCESS(CLCnCON,3)
// CLCnCON<INTP>
extern volatile __bit                   INTP                __at(0xD2C);	// @ (0x1A5 * 8 + 4)
#define                                 INTP_bit            _BIT_ACCESS(CLCnCON,4)
// I3C1DSTAT0<INTPEND1>
extern volatile __bit                   INTPEND1            __at(0x551);	// @ (0xAA * 8 + 1)
#define                                 INTPEND1_bit        _BIT_ACCESS(I3C1DSTAT0,1)
// I3C1DSTAT0<INTPEND2>
extern volatile __bit                   INTPEND2            __at(0x552);	// @ (0xAA * 8 + 2)
#define                                 INTPEND2_bit        _BIT_ACCESS(I3C1DSTAT0,2)
// I3C1DSTAT0<INTPEND3>
extern volatile __bit                   INTPEND3            __at(0x553);	// @ (0xAA * 8 + 3)
#define                                 INTPEND3_bit        _BIT_ACCESS(I3C1DSTAT0,3)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x20E8);	// @ (0x41D * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x20E9);	// @ (0x41D * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x20EA);	// @ (0x41D * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x20EB);	// @ (0x41D * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x20EC);	// @ (0x41D * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x20ED);	// @ (0x41D * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x20E0);	// @ (0x41C * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x20E1);	// @ (0x41C * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x20E2);	// @ (0x41C * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x20E3);	// @ (0x41C * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x20E4);	// @ (0x41C * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x20E5);	// @ (0x41C * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x20D8);	// @ (0x41B * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x20D9);	// @ (0x41B * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x20DA);	// @ (0x41B * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x20DB);	// @ (0x41B * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x20DC);	// @ (0x41B * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x20DD);	// @ (0x41B * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x2188);	// @ (0x431 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x2189);	// @ (0x431 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x218B);	// @ (0x431 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x218C);	// @ (0x431 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x218D);	// @ (0x431 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x218E);	// @ (0x431 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0x218F);	// @ (0x431 * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x2180);	// @ (0x430 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x2181);	// @ (0x430 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x2183);	// @ (0x430 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x2184);	// @ (0x430 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x2185);	// @ (0x430 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x2186);	// @ (0x430 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x2187);	// @ (0x430 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x2178);	// @ (0x42F * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x2179);	// @ (0x42F * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x217B);	// @ (0x42F * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x217C);	// @ (0x42F * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x217D);	// @ (0x42F * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x217E);	// @ (0x42F * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x217F);	// @ (0x42F * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// PIE3<IOCIE>
extern volatile __bit                   IOCIE               __at(0x23B4);	// @ (0x476 * 8 + 4)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<IOCIF>
extern volatile __bit                   IOCIF               __at(0x2364);	// @ (0x46C * 8 + 4)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR3,4)
// IPR3<IOCIP>
extern volatile __bit                   IOCIP               __at(0x2404);	// @ (0x480 * 8 + 4)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR3,4)
// PMD1<IOCMD>
extern volatile __bit                   IOCMD               __at(0x180A);	// @ (0x301 * 8 + 2)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD1,2)
// PIE5<IOCSRIE>
extern volatile __bit                   IOCSRIE             __at(0x23C7);	// @ (0x478 * 8 + 7)
#define                                 IOCSRIE_bit         _BIT_ACCESS(PIE5,7)
// PIR5<IOCSRIF>
extern volatile __bit                   IOCSRIF             __at(0x2377);	// @ (0x46E * 8 + 7)
#define                                 IOCSRIF_bit         _BIT_ACCESS(PIR5,7)
// IPR5<IOCSRIP>
extern volatile __bit                   IOCSRIP             __at(0x2417);	// @ (0x482 * 8 + 7)
#define                                 IOCSRIP_bit         _BIT_ACCESS(IPR5,7)
// IOCWF<IOCWF0>
extern volatile __bit                   IOCWF0              __at(0x22C8);	// @ (0x459 * 8 + 0)
#define                                 IOCWF0_bit          _BIT_ACCESS(IOCWF,0)
// IOCWF<IOCWF1>
extern volatile __bit                   IOCWF1              __at(0x22C9);	// @ (0x459 * 8 + 1)
#define                                 IOCWF1_bit          _BIT_ACCESS(IOCWF,1)
// IOCWF<IOCWF2>
extern volatile __bit                   IOCWF2              __at(0x22CA);	// @ (0x459 * 8 + 2)
#define                                 IOCWF2_bit          _BIT_ACCESS(IOCWF,2)
// IOCWF<IOCWF3>
extern volatile __bit                   IOCWF3              __at(0x22CB);	// @ (0x459 * 8 + 3)
#define                                 IOCWF3_bit          _BIT_ACCESS(IOCWF,3)
// IOCWF<IOCWF4>
extern volatile __bit                   IOCWF4              __at(0x22CC);	// @ (0x459 * 8 + 4)
#define                                 IOCWF4_bit          _BIT_ACCESS(IOCWF,4)
// IOCWF<IOCWF5>
extern volatile __bit                   IOCWF5              __at(0x22CD);	// @ (0x459 * 8 + 5)
#define                                 IOCWF5_bit          _BIT_ACCESS(IOCWF,5)
// IOCWF<IOCWF6>
extern volatile __bit                   IOCWF6              __at(0x22CE);	// @ (0x459 * 8 + 6)
#define                                 IOCWF6_bit          _BIT_ACCESS(IOCWF,6)
// IOCWF<IOCWF7>
extern volatile __bit                   IOCWF7              __at(0x22CF);	// @ (0x459 * 8 + 7)
#define                                 IOCWF7_bit          _BIT_ACCESS(IOCWF,7)
// IOCWN<IOCWN0>
extern volatile __bit                   IOCWN0              __at(0x22C0);	// @ (0x458 * 8 + 0)
#define                                 IOCWN0_bit          _BIT_ACCESS(IOCWN,0)
// IOCWN<IOCWN1>
extern volatile __bit                   IOCWN1              __at(0x22C1);	// @ (0x458 * 8 + 1)
#define                                 IOCWN1_bit          _BIT_ACCESS(IOCWN,1)
// IOCWN<IOCWN2>
extern volatile __bit                   IOCWN2              __at(0x22C2);	// @ (0x458 * 8 + 2)
#define                                 IOCWN2_bit          _BIT_ACCESS(IOCWN,2)
// IOCWN<IOCWN3>
extern volatile __bit                   IOCWN3              __at(0x22C3);	// @ (0x458 * 8 + 3)
#define                                 IOCWN3_bit          _BIT_ACCESS(IOCWN,3)
// IOCWN<IOCWN4>
extern volatile __bit                   IOCWN4              __at(0x22C4);	// @ (0x458 * 8 + 4)
#define                                 IOCWN4_bit          _BIT_ACCESS(IOCWN,4)
// IOCWN<IOCWN5>
extern volatile __bit                   IOCWN5              __at(0x22C5);	// @ (0x458 * 8 + 5)
#define                                 IOCWN5_bit          _BIT_ACCESS(IOCWN,5)
// IOCWN<IOCWN6>
extern volatile __bit                   IOCWN6              __at(0x22C6);	// @ (0x458 * 8 + 6)
#define                                 IOCWN6_bit          _BIT_ACCESS(IOCWN,6)
// IOCWN<IOCWN7>
extern volatile __bit                   IOCWN7              __at(0x22C7);	// @ (0x458 * 8 + 7)
#define                                 IOCWN7_bit          _BIT_ACCESS(IOCWN,7)
// IOCWP<IOCWP0>
extern volatile __bit                   IOCWP0              __at(0x22B8);	// @ (0x457 * 8 + 0)
#define                                 IOCWP0_bit          _BIT_ACCESS(IOCWP,0)
// IOCWP<IOCWP1>
extern volatile __bit                   IOCWP1              __at(0x22B9);	// @ (0x457 * 8 + 1)
#define                                 IOCWP1_bit          _BIT_ACCESS(IOCWP,1)
// IOCWP<IOCWP2>
extern volatile __bit                   IOCWP2              __at(0x22BA);	// @ (0x457 * 8 + 2)
#define                                 IOCWP2_bit          _BIT_ACCESS(IOCWP,2)
// IOCWP<IOCWP3>
extern volatile __bit                   IOCWP3              __at(0x22BB);	// @ (0x457 * 8 + 3)
#define                                 IOCWP3_bit          _BIT_ACCESS(IOCWP,3)
// IOCWP<IOCWP4>
extern volatile __bit                   IOCWP4              __at(0x22BC);	// @ (0x457 * 8 + 4)
#define                                 IOCWP4_bit          _BIT_ACCESS(IOCWP,4)
// IOCWP<IOCWP5>
extern volatile __bit                   IOCWP5              __at(0x22BD);	// @ (0x457 * 8 + 5)
#define                                 IOCWP5_bit          _BIT_ACCESS(IOCWP,5)
// IOCWP<IOCWP6>
extern volatile __bit                   IOCWP6              __at(0x22BE);	// @ (0x457 * 8 + 6)
#define                                 IOCWP6_bit          _BIT_ACCESS(IOCWP,6)
// IOCWP<IOCWP7>
extern volatile __bit                   IOCWP7              __at(0x22BF);	// @ (0x457 * 8 + 7)
#define                                 IOCWP7_bit          _BIT_ACCESS(IOCWP,7)
// CWG1ISM<ISM0>
extern volatile __bit                   ISM0                __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 ISM0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<ISM1>
extern volatile __bit                   ISM1                __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 ISM1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<ISM2>
extern volatile __bit                   ISM2                __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 ISM2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<ISM3>
extern volatile __bit                   ISM3                __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 ISM3_bit            _BIT_ACCESS(CWG1ISM,3)
// CWG1ISM<ISM4>
extern volatile __bit                   ISM4                __at(0xCD4);	// @ (0x19A * 8 + 4)
#define                                 ISM4_bit            _BIT_ACCESS(CWG1ISM,4)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
extern volatile __bit                   ISRPR1              __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 ISRPR1_bit          _BIT_ACCESS(ISRPR,1)
// ISRPR<ISRPR2>
extern volatile __bit                   ISRPR2              __at(0x1D2);	// @ (0x3A * 8 + 2)
#define                                 ISRPR2_bit          _BIT_ACCESS(ISRPR,2)
// IVTLOCK<IVTLOCKED>
extern volatile __bit                   IVTLOCKED           __at(0x2300);	// @ (0x460 * 8 + 0)
#define                                 IVTLOCKED_bit       _BIT_ACCESS(IVTLOCK,0)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x362);	// @ (0x6C * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x363);	// @ (0x6C * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x364);	// @ (0x6C * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x365);	// @ (0x6C * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x366);	// @ (0x6C * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x367);	// @ (0x6C * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x35A);	// @ (0x6B * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x36C);	// @ (0x6D * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x36D);	// @ (0x6D * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x35B);	// @ (0x6B * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x35E);	// @ (0x6B * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x35F);	// @ (0x6B * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x361);	// @ (0x6C * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x2498);	// @ (0x493 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x2499);	// @ (0x493 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x249A);	// @ (0x493 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x249C);	// @ (0x493 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x249D);	// @ (0x493 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x24A8);	// @ (0x495 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x24A9);	// @ (0x495 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x24AB);	// @ (0x495 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x24AC);	// @ (0x495 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x24AD);	// @ (0x495 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x24AE);	// @ (0x495 * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x24AF);	// @ (0x495 * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATW<LATW0>
extern volatile __bit                   LATW0               __at(0x24D0);	// @ (0x49A * 8 + 0)
#define                                 LATW0_bit           _BIT_ACCESS(LATW,0)
// LATW<LATW1>
extern volatile __bit                   LATW1               __at(0x24D1);	// @ (0x49A * 8 + 1)
#define                                 LATW1_bit           _BIT_ACCESS(LATW,1)
// LATW<LATW2>
extern volatile __bit                   LATW2               __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 LATW2_bit           _BIT_ACCESS(LATW,2)
// LATW<LATW3>
extern volatile __bit                   LATW3               __at(0x24D3);	// @ (0x49A * 8 + 3)
#define                                 LATW3_bit           _BIT_ACCESS(LATW,3)
// LATW<LATW4>
extern volatile __bit                   LATW4               __at(0x24D4);	// @ (0x49A * 8 + 4)
