garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
#define                                 LATW4_bit           _BIT_ACCESS(LATW,4)
// LATW<LATW5>
extern volatile __bit                   LATW5               __at(0x24D5);	// @ (0x49A * 8 + 5)
#define                                 LATW5_bit           _BIT_ACCESS(LATW,5)
// LATW<LATW6>
extern volatile __bit                   LATW6               __at(0x24D6);	// @ (0x49A * 8 + 6)
#define                                 LATW6_bit           _BIT_ACCESS(LATW,6)
// LATW<LATW7>
extern volatile __bit                   LATW7               __at(0x24D7);	// @ (0x49A * 8 + 7)
#define                                 LATW7_bit           _BIT_ACCESS(LATW,7)
// CRCCON0<LENDIAN>
extern volatile __bit                   LENDIAN             __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 LENDIAN_bit         _BIT_ACCESS(CRCCON0,1)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x3F4);	// @ (0x7E * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x3EC);	// @ (0x7D * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// ACTCON<LOCK>
extern volatile __bit                   LOCK                __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 LOCK_bit            _BIT_ACCESS(ACTCON,3)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0xCFA);	// @ (0x19F * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0xCFD);	// @ (0x19F * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// SPI1CON0<LSBF>
extern volatile __bit                   LSBF                __at(0xEDA);	// @ (0x1DB * 8 + 2)
#define                                 LSBF_bit            _BIT_ACCESS(SPI1CON0,2)
// CWG1AS0<LSCA1>
extern volatile __bit                   LSCA1               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 LSCA1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSDB0>
extern volatile __bit                   LSDB0               __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 LSDB0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSDB1>
extern volatile __bit                   LSDB1               __at(0xCFD);	// @ (0x19F * 8 + 5)
#define                                 LSDB1_bit           _BIT_ACCESS(CWG1AS0,5)
// ADLTHL<LTH0>
extern volatile __bit                   LTH0                __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 LTH0_bit            _BIT_ACCESS(ADLTHL,0)
// ADLTHL<LTH1>
extern volatile __bit                   LTH1                __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 LTH1_bit            _BIT_ACCESS(ADLTHL,1)
// ADLTHH<LTH10>
extern volatile __bit                   LTH10               __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 LTH10_bit           _BIT_ACCESS(ADLTHH,2)
// ADLTHH<LTH11>
extern volatile __bit                   LTH11               __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 LTH11_bit           _BIT_ACCESS(ADLTHH,3)
// ADLTHH<LTH12>
extern volatile __bit                   LTH12               __at(0x10B4);	// @ (0x216 * 8 + 4)
#define                                 LTH12_bit           _BIT_ACCESS(ADLTHH,4)
// ADLTHH<LTH13>
extern volatile __bit                   LTH13               __at(0x10B5);	// @ (0x216 * 8 + 5)
#define                                 LTH13_bit           _BIT_ACCESS(ADLTHH,5)
// ADLTHH<LTH14>
extern volatile __bit                   LTH14               __at(0x10B6);	// @ (0x216 * 8 + 6)
#define                                 LTH14_bit           _BIT_ACCESS(ADLTHH,6)
// ADLTHH<LTH15>
extern volatile __bit                   LTH15               __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 LTH15_bit           _BIT_ACCESS(ADLTHH,7)
// ADLTHL<LTH2>
extern volatile __bit                   LTH2                __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 LTH2_bit            _BIT_ACCESS(ADLTHL,2)
// ADLTHL<LTH3>
extern volatile __bit                   LTH3                __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 LTH3_bit            _BIT_ACCESS(ADLTHL,3)
// ADLTHL<LTH4>
extern volatile __bit                   LTH4                __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 LTH4_bit            _BIT_ACCESS(ADLTHL,4)
// ADLTHL<LTH5>
extern volatile __bit                   LTH5                __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 LTH5_bit            _BIT_ACCESS(ADLTHL,5)
// ADLTHL<LTH6>
extern volatile __bit                   LTH6                __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 LTH6_bit            _BIT_ACCESS(ADLTHL,6)
// ADLTHL<LTH7>
extern volatile __bit                   LTH7                __at(0x10AF);	// @ (0x215 * 8 + 7)
#define                                 LTH7_bit            _BIT_ACCESS(ADLTHL,7)
// ADLTHH<LTH8>
extern volatile __bit                   LTH8                __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 LTH8_bit            _BIT_ACCESS(ADLTHH,0)
// ADLTHH<LTH9>
extern volatile __bit                   LTH9                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 LTH9_bit            _BIT_ACCESS(ADLTHH,1)
// ADSTAT<LTHR>
extern volatile __bit                   LTHR                __at(0x119D);	// @ (0x233 * 8 + 5)
#define                                 LTHR_bit            _BIT_ACCESS(ADSTAT,5)
// MAINPR<MAINPR0>
extern volatile __bit                   MAINPR0             __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 MAINPR0_bit         _BIT_ACCESS(MAINPR,0)
// MAINPR<MAINPR1>
extern volatile __bit                   MAINPR1             __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 MAINPR1_bit         _BIT_ACCESS(MAINPR,1)
// MAINPR<MAINPR2>
extern volatile __bit                   MAINPR2             __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 MAINPR2_bit         _BIT_ACCESS(MAINPR,2)
// ADSTAT<MATH>
extern volatile __bit                   MATH                __at(0x119C);	// @ (0x233 * 8 + 4)
#define                                 MATH_bit            _BIT_ACCESS(ADSTAT,4)
// ADCON2<MD0>
extern volatile __bit                   MD0                 __at(0x1188);	// @ (0x231 * 8 + 0)
#define                                 MD0_bit             _BIT_ACCESS(ADCON2,0)
// ADCON2<MD1>
extern volatile __bit                   MD1                 __at(0x1189);	// @ (0x231 * 8 + 1)
#define                                 MD1_bit             _BIT_ACCESS(ADCON2,1)
// T0CON0<MD16>
extern volatile __bit                   MD16                __at(0x82C);	// @ (0x105 * 8 + 4)
#define                                 MD16_bit            _BIT_ACCESS(T0CON0,4)
// ADCON2<MD2>
extern volatile __bit                   MD2                 __at(0x118A);	// @ (0x231 * 8 + 2)
#define                                 MD2_bit             _BIT_ACCESS(ADCON2,2)
// I2C1CON0<MDR>
extern volatile __bit                   MDR                 __at(0xF33);	// @ (0x1E6 * 8 + 3)
#define                                 MDR_bit             _BIT_ACCESS(I2C1CON0,3)
// PCON1<MEMV>
extern volatile __bit                   MEMV                __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 MEMV_bit            _BIT_ACCESS(PCON1,1)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x3F5);	// @ (0x7E * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x3ED);	// @ (0x7D * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// I2C1STAT0<MMA>
extern volatile __bit                   MMA                 __at(0xF25);	// @ (0x1E4 * 8 + 5)
#define                                 MMA_bit             _BIT_ACCESS(I2C1STAT0,5)
// PWMEN<MPWM1EN>
extern volatile __bit                   MPWM1EN             __at(0xA90);	// @ (0x152 * 8 + 0)
#define                                 MPWM1EN_bit         _BIT_ACCESS(PWMEN,0)
// PWMLOAD<MPWM1LD>
extern volatile __bit                   MPWM1LD             __at(0xA88);	// @ (0x151 * 8 + 0)
#define                                 MPWM1LD_bit         _BIT_ACCESS(PWMLOAD,0)
// PWMEN<MPWM2EN>
extern volatile __bit                   MPWM2EN             __at(0xA91);	// @ (0x152 * 8 + 1)
#define                                 MPWM2EN_bit         _BIT_ACCESS(PWMEN,1)
// PWMLOAD<MPWM2LD>
extern volatile __bit                   MPWM2LD             __at(0xA89);	// @ (0x151 * 8 + 1)
#define                                 MPWM2LD_bit         _BIT_ACCESS(PWMLOAD,1)
// SCANCON0<MREG>
extern volatile __bit                   MREG                __at(0x38A);	// @ (0x71 * 8 + 2)
#define                                 MREG_bit            _BIT_ACCESS(SCANCON0,2)
// I3C1MRS<MRS0>
extern volatile __bit                   MRS0                __at(0x568);	// @ (0xAD * 8 + 0)
#define                                 MRS0_bit            _BIT_ACCESS(I3C1MRS,0)
// I3C1MRS<MRS1>
extern volatile __bit                   MRS1                __at(0x569);	// @ (0xAD * 8 + 1)
#define                                 MRS1_bit            _BIT_ACCESS(I3C1MRS,1)
// I3C1MRS<MRS2>
extern volatile __bit                   MRS2                __at(0x56A);	// @ (0xAD * 8 + 2)
#define                                 MRS2_bit            _BIT_ACCESS(I3C1MRS,2)
// I3C1MRS<MRS3>
extern volatile __bit                   MRS3                __at(0x56B);	// @ (0xAD * 8 + 3)
#define                                 MRS3_bit            _BIT_ACCESS(I3C1MRS,3)
// I3C1MRS<MRS4>
extern volatile __bit                   MRS4                __at(0x56C);	// @ (0xAD * 8 + 4)
#define                                 MRS4_bit            _BIT_ACCESS(I3C1MRS,4)
// I3C1MRS<MRS5>
extern volatile __bit                   MRS5                __at(0x56D);	// @ (0xAD * 8 + 5)
#define                                 MRS5_bit            _BIT_ACCESS(I3C1MRS,5)
// I3C1MRS<MRS6>
extern volatile __bit                   MRS6                __at(0x56E);	// @ (0xAD * 8 + 6)
#define                                 MRS6_bit            _BIT_ACCESS(I3C1MRS,6)
// I3C1MRS<MRS7>
extern volatile __bit                   MRS7                __at(0x56F);	// @ (0xAD * 8 + 7)
#define                                 MRS7_bit            _BIT_ACCESS(I3C1MRS,7)
// SPI1CON0<MST>
extern volatile __bit                   MST                 __at(0xED9);	// @ (0x1DB * 8 + 1)
#define                                 MST_bit             _BIT_ACCESS(SPI1CON0,1)
// I3C1ERRIE1<MWLOEIE>
extern volatile __bit                   MWLOEIE             __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 MWLOEIE_bit         _BIT_ACCESS(I3C1ERRIE1,2)
// I3C1ERRIR1<MWLOEIF>
extern volatile __bit                   MWLOEIF             __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 MWLOEIF_bit         _BIT_ACCESS(I3C1ERRIR1,2)
// I3C1MWS<MWS0>
extern volatile __bit                   MWS0                __at(0x560);	// @ (0xAC * 8 + 0)
#define                                 MWS0_bit            _BIT_ACCESS(I3C1MWS,0)
// I3C1MWS<MWS1>
extern volatile __bit                   MWS1                __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 MWS1_bit            _BIT_ACCESS(I3C1MWS,1)
// I3C1MWS<MWS2>
extern volatile __bit                   MWS2                __at(0x562);	// @ (0xAC * 8 + 2)
#define                                 MWS2_bit            _BIT_ACCESS(I3C1MWS,2)
// I3C1MWS<MWS3>
extern volatile __bit                   MWS3                __at(0x563);	// @ (0xAC * 8 + 3)
#define                                 MWS3_bit            _BIT_ACCESS(I3C1MWS,3)
// I3C1MWS<MWS4>
extern volatile __bit                   MWS4                __at(0x564);	// @ (0xAC * 8 + 4)
#define                                 MWS4_bit            _BIT_ACCESS(I3C1MWS,4)
// I3C1MWS<MWS5>
extern volatile __bit                   MWS5                __at(0x565);	// @ (0xAC * 8 + 5)
#define                                 MWS5_bit            _BIT_ACCESS(I3C1MWS,5)
// I3C1MWS<MWS6>
extern volatile __bit                   MWS6                __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 MWS6_bit            _BIT_ACCESS(I3C1MWS,6)
// I3C1MWS<MWS7>
extern volatile __bit                   MWS7                __at(0x567);	// @ (0xAC * 8 + 7)
#define                                 MWS7_bit            _BIT_ACCESS(I3C1MWS,7)
// I2C1ERR<NACK1IE>
extern volatile __bit                   NACK1IE             __at(0xF60);	// @ (0x1EC * 8 + 0)
#define                                 NACK1IE_bit         _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACK1IF>
extern volatile __bit                   NACK1IF             __at(0xF64);	// @ (0x1EC * 8 + 4)
#define                                 NACK1IF_bit         _BIT_ACCESS(I2C1ERR,4)
// I2C1ERR<NACKIE>
extern volatile __bit                   NACKIE              __at(0xF60);	// @ (0x1EC * 8 + 0)
#define                                 NACKIE_bit          _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACKIF>
extern volatile __bit                   NACKIF              __at(0xF64);	// @ (0x1EC * 8 + 4)
#define                                 NACKIF_bit          _BIT_ACCESS(I2C1ERR,4)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x3D0);	// @ (0x7A * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x3D1);	// @ (0x7A * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x3D2);	// @ (0x7A * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x3D3);	// @ (0x7A * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x3D4);	// @ (0x7A * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x3D5);	// @ (0x7A * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x3D6);	// @ (0x7A * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x3E3);	// @ (0x7C * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// I2C1STAT0<NOT_A>
extern volatile __bit                   NOT_A               __at(0xF23);	// @ (0x1E4 * 8 + 3)
#define                                 NOT_A_bit           _BIT_ACCESS(I2C1STAT0,3)
// I2C1STAT0<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0xF23);	// @ (0x1E4 * 8 + 3)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(I2C1STAT0,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON1<NOT_PORVDDIO2>
extern volatile __bit                   NOT_PORVDDIO2       __at(0x278B);	// @ (0x4F1 * 8 + 3)
#define                                 NOT_PORVDDIO2_bit   _BIT_ACCESS(PCON1,3)
// PCON1<NOT_RCM>
extern volatile __bit                   NOT_RCM             __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 NOT_RCM_bit         _BIT_ACCESS(PCON1,0)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON1<NOT_RVREG>
extern volatile __bit                   NOT_RVREG           __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 NOT_RVREG_bit       _BIT_ACCESS(PCON1,2)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1CON<NOT_SYNC>
extern volatile __bit                   NOT_SYNC            __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 NOT_SYNC_bit        _BIT_ACCESS(T1CON,2)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x853);	// @ (0x10A * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// I2C1STAT0<NOT_W>
extern volatile __bit                   NOT_W               __at(0xF24);	// @ (0x1E4 * 8 + 4)
#define                                 NOT_W_bit           _BIT_ACCESS(I2C1STAT0,4)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// I2C1STAT0<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0xF24);	// @ (0x1E4 * 8 + 4)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(I2C1STAT0,4)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x11A4);	// @ (0x234 * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x2D8);	// @ (0x5B * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x2D9);	// @ (0x5B * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x2E2);	// @ (0x5C * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x2E3);	// @ (0x5C * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x2E4);	// @ (0x5C * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x2E5);	// @ (0x5C * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x2E6);	// @ (0x5C * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRH<NVMADR15>
extern volatile __bit                   NVMADR15            __at(0x2E7);	// @ (0x5C * 8 + 7)
#define                                 NVMADR15_bit        _BIT_ACCESS(NVMADRH,7)
// NVMADRU<NVMADR16>
extern volatile __bit                   NVMADR16            __at(0x2E8);	// @ (0x5D * 8 + 0)
#define                                 NVMADR16_bit        _BIT_ACCESS(NVMADRU,0)
// NVMADRU<NVMADR17>
extern volatile __bit                   NVMADR17            __at(0x2E9);	// @ (0x5D * 8 + 1)
#define                                 NVMADR17_bit        _BIT_ACCESS(NVMADRU,1)
// NVMADRU<NVMADR18>
extern volatile __bit                   NVMADR18            __at(0x2EA);	// @ (0x5D * 8 + 2)
#define                                 NVMADR18_bit        _BIT_ACCESS(NVMADRU,2)
// NVMADRU<NVMADR19>
extern volatile __bit                   NVMADR19            __at(0x2EB);	// @ (0x5D * 8 + 3)
#define                                 NVMADR19_bit        _BIT_ACCESS(NVMADRU,3)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x2DA);	// @ (0x5B * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRU<NVMADR20>
extern volatile __bit                   NVMADR20            __at(0x2EC);	// @ (0x5D * 8 + 4)
#define                                 NVMADR20_bit        _BIT_ACCESS(NVMADRU,4)
// NVMADRU<NVMADR21>
extern volatile __bit                   NVMADR21            __at(0x2ED);	// @ (0x5D * 8 + 5)
#define                                 NVMADR21_bit        _BIT_ACCESS(NVMADRU,5)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x2DB);	// @ (0x5B * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x2DC);	// @ (0x5B * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x2DD);	// @ (0x5B * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x2DE);	// @ (0x5B * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x2DF);	// @ (0x5B * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x2E0);	// @ (0x5C * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x2E1);	// @ (0x5C * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x2F0);	// @ (0x5E * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x2F1);	// @ (0x5E * 8 + 1)
