garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f05q20.h
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x2FA);	// @ (0x5F * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x2FB);	// @ (0x5F * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x2FC);	// @ (0x5F * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x2FD);	// @ (0x5F * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATH<NVMDAT14>
extern volatile __bit                   NVMDAT14            __at(0x2FE);	// @ (0x5F * 8 + 6)
#define                                 NVMDAT14_bit        _BIT_ACCESS(NVMDATH,6)
// NVMDATH<NVMDAT15>
extern volatile __bit                   NVMDAT15            __at(0x2FF);	// @ (0x5F * 8 + 7)
#define                                 NVMDAT15_bit        _BIT_ACCESS(NVMDATH,7)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x2F2);	// @ (0x5E * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x2F3);	// @ (0x5E * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x2F4);	// @ (0x5E * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x2F5);	// @ (0x5E * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x2F6);	// @ (0x5E * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x2F7);	// @ (0x5E * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x2F8);	// @ (0x5F * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x2F9);	// @ (0x5F * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// NVMCON0<NVMGO>
extern volatile __bit                   NVMGO               __at(0x2C0);	// @ (0x58 * 8 + 0)
#define                                 NVMGO_bit           _BIT_ACCESS(NVMCON0,0)
// PIE2<NVMIE>
extern volatile __bit                   NVMIE               __at(0x23AC);	// @ (0x475 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<NVMIF>
extern volatile __bit                   NVMIF               __at(0x235C);	// @ (0x46B * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR2,4)
// IPR2<NVMIP>
extern volatile __bit                   NVMIP               __at(0x23FC);	// @ (0x47F * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR2,4)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x20C0);	// @ (0x418 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x20C1);	// @ (0x418 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x20C2);	// @ (0x418 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x20C4);	// @ (0x418 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x20C5);	// @ (0x418 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2160);	// @ (0x42C * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2161);	// @ (0x42C * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2163);	// @ (0x42C * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2164);	// @ (0x42C * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2165);	// @ (0x42C * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x2166);	// @ (0x42C * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x2167);	// @ (0x42C * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x3E4);	// @ (0x7C * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// ACTCON<ORS>
extern volatile __bit                   ORS                 __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 ORS_bit             _BIT_ACCESS(ACTCON,1)
// PIE3<OSFIE>
extern volatile __bit                   OSFIE               __at(0x23B1);	// @ (0x476 * 8 + 1)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE3,1)
// PIR3<OSFIF>
extern volatile __bit                   OSFIF               __at(0x2361);	// @ (0x46C * 8 + 1)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR3,1)
// IPR3<OSFIP>
extern volatile __bit                   OSFIP               __at(0x2401);	// @ (0x480 * 8 + 1)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR3,1)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0x32C);	// @ (0x65 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0x330);	// @ (0x66 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0x332);	// @ (0x66 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0x333);	// @ (0x66 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0x334);	// @ (0x66 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0x325);	// @ (0x64 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0x326);	// @ (0x64 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0x327);	// @ (0x64 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0x329);	// @ (0x65 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0xD0C);	// @ (0x1A1 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0xD0D);	// @ (0x1A1 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0xD0E);	// @ (0x1A1 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0xD0F);	// @ (0x1A1 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0xDA0);	// @ (0x1B4 * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0xDB0);	// @ (0x1B6 * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0xDC0);	// @ (0x1B8 * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0xF5A);	// @ (0x1EB * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0xF52);	// @ (0x1EA * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0x1181);	// @ (0x230 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// I3C1DSTAT0<PERR>
extern volatile __bit                   PERR                __at(0x555);	// @ (0xAA * 8 + 5)
#define                                 PERR_bit            _BIT_ACCESS(I3C1DSTAT0,5)
// I3C1PID0<PID0>
extern volatile __bit                   PID0                __at(0x510);	// @ (0xA2 * 8 + 0)
#define                                 PID0_bit            _BIT_ACCESS(I3C1PID0,0)
// I3C1PID0<PID1>
extern volatile __bit                   PID1                __at(0x511);	// @ (0xA2 * 8 + 1)
#define                                 PID1_bit            _BIT_ACCESS(I3C1PID0,1)
// I3C1PID1<PID10>
extern volatile __bit                   PID10               __at(0x51A);	// @ (0xA3 * 8 + 2)
#define                                 PID10_bit           _BIT_ACCESS(I3C1PID1,2)
// I3C1PID1<PID11>
extern volatile __bit                   PID11               __at(0x51B);	// @ (0xA3 * 8 + 3)
#define                                 PID11_bit           _BIT_ACCESS(I3C1PID1,3)
// I3C1PID1<PID12>
extern volatile __bit                   PID12               __at(0x51C);	// @ (0xA3 * 8 + 4)
#define                                 PID12_bit           _BIT_ACCESS(I3C1PID1,4)
// I3C1PID1<PID13>
extern volatile __bit                   PID13               __at(0x51D);	// @ (0xA3 * 8 + 5)
#define                                 PID13_bit           _BIT_ACCESS(I3C1PID1,5)
// I3C1PID1<PID14>
extern volatile __bit                   PID14               __at(0x51E);	// @ (0xA3 * 8 + 6)
#define                                 PID14_bit           _BIT_ACCESS(I3C1PID1,6)
// I3C1PID1<PID15>
extern volatile __bit                   PID15               __at(0x51F);	// @ (0xA3 * 8 + 7)
#define                                 PID15_bit           _BIT_ACCESS(I3C1PID1,7)
// I3C1PID2<PID16>
extern volatile __bit                   PID16               __at(0x520);	// @ (0xA4 * 8 + 0)
#define                                 PID16_bit           _BIT_ACCESS(I3C1PID2,0)
// I3C1PID2<PID17>
extern volatile __bit                   PID17               __at(0x521);	// @ (0xA4 * 8 + 1)
#define                                 PID17_bit           _BIT_ACCESS(I3C1PID2,1)
// I3C1PID2<PID18>
extern volatile __bit                   PID18               __at(0x522);	// @ (0xA4 * 8 + 2)
#define                                 PID18_bit           _BIT_ACCESS(I3C1PID2,2)
// I3C1PID2<PID19>
extern volatile __bit                   PID19               __at(0x523);	// @ (0xA4 * 8 + 3)
#define                                 PID19_bit           _BIT_ACCESS(I3C1PID2,3)
// I3C1PID0<PID2>
extern volatile __bit                   PID2                __at(0x512);	// @ (0xA2 * 8 + 2)
#define                                 PID2_bit            _BIT_ACCESS(I3C1PID0,2)
// I3C1PID2<PID20>
extern volatile __bit                   PID20               __at(0x524);	// @ (0xA4 * 8 + 4)
#define                                 PID20_bit           _BIT_ACCESS(I3C1PID2,4)
// I3C1PID2<PID21>
extern volatile __bit                   PID21               __at(0x525);	// @ (0xA4 * 8 + 5)
#define                                 PID21_bit           _BIT_ACCESS(I3C1PID2,5)
// I3C1PID2<PID22>
extern volatile __bit                   PID22               __at(0x526);	// @ (0xA4 * 8 + 6)
#define                                 PID22_bit           _BIT_ACCESS(I3C1PID2,6)
// I3C1PID2<PID23>
extern volatile __bit                   PID23               __at(0x527);	// @ (0xA4 * 8 + 7)
#define                                 PID23_bit           _BIT_ACCESS(I3C1PID2,7)
// I3C1PID3<PID24>
extern volatile __bit                   PID24               __at(0x528);	// @ (0xA5 * 8 + 0)
#define                                 PID24_bit           _BIT_ACCESS(I3C1PID3,0)
// I3C1PID3<PID25>
extern volatile __bit                   PID25               __at(0x529);	// @ (0xA5 * 8 + 1)
#define                                 PID25_bit           _BIT_ACCESS(I3C1PID3,1)
// I3C1PID3<PID26>
extern volatile __bit                   PID26               __at(0x52A);	// @ (0xA5 * 8 + 2)
#define                                 PID26_bit           _BIT_ACCESS(I3C1PID3,2)
// I3C1PID3<PID27>
extern volatile __bit                   PID27               __at(0x52B);	// @ (0xA5 * 8 + 3)
#define                                 PID27_bit           _BIT_ACCESS(I3C1PID3,3)
// I3C1PID3<PID28>
extern volatile __bit                   PID28               __at(0x52C);	// @ (0xA5 * 8 + 4)
#define                                 PID28_bit           _BIT_ACCESS(I3C1PID3,4)
// I3C1PID3<PID29>
extern volatile __bit                   PID29               __at(0x52D);	// @ (0xA5 * 8 + 5)
#define                                 PID29_bit           _BIT_ACCESS(I3C1PID3,5)
// I3C1PID0<PID3>
extern volatile __bit                   PID3                __at(0x513);	// @ (0xA2 * 8 + 3)
#define                                 PID3_bit            _BIT_ACCESS(I3C1PID0,3)
// I3C1PID3<PID30>
extern volatile __bit                   PID30               __at(0x52E);	// @ (0xA5 * 8 + 6)
#define                                 PID30_bit           _BIT_ACCESS(I3C1PID3,6)
// I3C1PID3<PID31>
extern volatile __bit                   PID31               __at(0x52F);	// @ (0xA5 * 8 + 7)
#define                                 PID31_bit           _BIT_ACCESS(I3C1PID3,7)
// I3C1PID4<PID32>
extern volatile __bit                   PID32               __at(0x530);	// @ (0xA6 * 8 + 0)
#define                                 PID32_bit           _BIT_ACCESS(I3C1PID4,0)
// I3C1PID4<PID33>
extern volatile __bit                   PID33               __at(0x531);	// @ (0xA6 * 8 + 1)
#define                                 PID33_bit           _BIT_ACCESS(I3C1PID4,1)
// I3C1PID4<PID34>
extern volatile __bit                   PID34               __at(0x532);	// @ (0xA6 * 8 + 2)
#define                                 PID34_bit           _BIT_ACCESS(I3C1PID4,2)
// I3C1PID4<PID35>
extern volatile __bit                   PID35               __at(0x533);	// @ (0xA6 * 8 + 3)
#define                                 PID35_bit           _BIT_ACCESS(I3C1PID4,3)
// I3C1PID4<PID36>
extern volatile __bit                   PID36               __at(0x534);	// @ (0xA6 * 8 + 4)
#define                                 PID36_bit           _BIT_ACCESS(I3C1PID4,4)
// I3C1PID4<PID37>
extern volatile __bit                   PID37               __at(0x535);	// @ (0xA6 * 8 + 5)
#define                                 PID37_bit           _BIT_ACCESS(I3C1PID4,5)
// I3C1PID4<PID38>
extern volatile __bit                   PID38               __at(0x536);	// @ (0xA6 * 8 + 6)
#define                                 PID38_bit           _BIT_ACCESS(I3C1PID4,6)
// I3C1PID4<PID39>
extern volatile __bit                   PID39               __at(0x537);	// @ (0xA6 * 8 + 7)
#define                                 PID39_bit           _BIT_ACCESS(I3C1PID4,7)
// I3C1PID0<PID4>
extern volatile __bit                   PID4                __at(0x514);	// @ (0xA2 * 8 + 4)
#define                                 PID4_bit            _BIT_ACCESS(I3C1PID0,4)
// I3C1PID5<PID40>
extern volatile __bit                   PID40               __at(0x538);	// @ (0xA7 * 8 + 0)
#define                                 PID40_bit           _BIT_ACCESS(I3C1PID5,0)
// I3C1PID5<PID41>
extern volatile __bit                   PID41               __at(0x539);	// @ (0xA7 * 8 + 1)
#define                                 PID41_bit           _BIT_ACCESS(I3C1PID5,1)
// I3C1PID5<PID42>
extern volatile __bit                   PID42               __at(0x53A);	// @ (0xA7 * 8 + 2)
#define                                 PID42_bit           _BIT_ACCESS(I3C1PID5,2)
// I3C1PID5<PID43>
extern volatile __bit                   PID43               __at(0x53B);	// @ (0xA7 * 8 + 3)
#define                                 PID43_bit           _BIT_ACCESS(I3C1PID5,3)
// I3C1PID5<PID44>
extern volatile __bit                   PID44               __at(0x53C);	// @ (0xA7 * 8 + 4)
#define                                 PID44_bit           _BIT_ACCESS(I3C1PID5,4)
// I3C1PID5<PID45>
extern volatile __bit                   PID45               __at(0x53D);	// @ (0xA7 * 8 + 5)
#define                                 PID45_bit           _BIT_ACCESS(I3C1PID5,5)
// I3C1PID5<PID46>
extern volatile __bit                   PID46               __at(0x53E);	// @ (0xA7 * 8 + 6)
#define                                 PID46_bit           _BIT_ACCESS(I3C1PID5,6)
// I3C1PID5<PID47>
extern volatile __bit                   PID47               __at(0x53F);	// @ (0xA7 * 8 + 7)
#define                                 PID47_bit           _BIT_ACCESS(I3C1PID5,7)
// I3C1PID0<PID5>
extern volatile __bit                   PID5                __at(0x515);	// @ (0xA2 * 8 + 5)
#define                                 PID5_bit            _BIT_ACCESS(I3C1PID0,5)
// I3C1PID0<PID6>
extern volatile __bit                   PID6                __at(0x516);	// @ (0xA2 * 8 + 6)
